{"title": ["AITA for confronting my ex about her cheating?", "Wibtah putting a condom in my girlfriends car", "AITA for waking up my roommate and his girlfriend in a rage?", "AITA for being rude to my doctor?", "AITA for hating my birthday present?", "WIBTA if I told my boyfriend's mom I didn't want kids?", "WIBTA if I talk to the exchange student about what her boyfriend really thinks of her?", "AITA for not allowing my (28M) gf (30F) to go with me to my High school 10 year reunion?", "AITA for turning the vehicle around on my mom going to a football game?", "AITA for sending a screamer to a woman who sent me a virus link?", "AITA for expecting my BIL to wear clothes for Christmas?"], "body": ["I broke up with my ex a year and a half ago. We had been dating for over 4 years and out of the blue, she wanted to break up. I thought things had been going great. We had been talking about getting married and moving in together and all of a sudden, she wanted to end things. The day before, we had been making anniversary plans and when I called her the next day, she said we should cancel them and we should break up. I tried talking to her and even drove out an hour just to talk to her but she refused to give me any other information. \n\nNot sure if relevant, but she had closed off to me in the past and broken up out of nowhere. During those times, I tried really hard to reach out and try to resolve things but this time, I was just tired. So for about a year, I didn't talk to her and just felt shitty about the whole situation. A few months ago, I was hanging out with some mutual friends and they were telling me about her new BF. It's been like a year at that point. I\"m still a little sore about it but she can date whoever she wants. But as we're talking, I realize that their \"anniversary\" overlaps with the time when she and I were still dating for a period of a few months. I was devastated. \n\nOf course I minded the cheating but I was more upset that she didn't tell me THIS was the reason. I spent months blaming myself for ruining what I had perceived to be a perfect relationship. This made me really upset to the point where I fell into a little bit of a depressive state. I had doubts about ever finding someone and had panic attacks about how I could trust anyone in the future. \n\nRecently, I got back into dating and I'm reminded of this whole situation again and I feel like shit. So I had a guy's night out and got trashed. At the end of the night, I ended up texting her and telling her she should've just told me about it and that I know I know why she broke up with me. I realize it's been over a year and maybe I should've just moved on. But am AITA for bringing it up when she's happily moved on with someone else? (Side note, a few of my friends think they are getting engaged soon haha....)", "Wibtah, me(t) my girlfriend (j) and girlfriends sister(m)\n\nI’ve been with j for 4 years now, we’ve had our ups and downs and broke up for a week in that time, otherwise we’re happy. \n\nLast week m comes to me and says don’t tell j I told you this but, j’s been going on dates with another guy behind your back. I was upset but grateful m told me this. M did show me proof so it’s not just a sister fight, and no myself and m don’t have feelings for each other.\n\nI let this sink in and how I was going to confront j, I came up with the idea to leave a used condom in her car because that’s where she was fooling around with this guy. I figure I’d offer to detail j’s car one day and come across the condom and confront her this way so that m doesn’t get involved in a argument with j. I just want to make it look like j and this guy were careless and that’s how I found out. My brother thinks lying to j makes me an ass because he knows I hate confrontation and I want to take the easy way out. So am I a ass for setting her up?", "[removed]", "[removed]", "Last year for my 16th birthday, I really wanted an IPhone 7 or 8 because I was tired of my little 6s and wanted something nice for my big birthday. I made sure everyone knew what I wanted, and I said if it wasn’t that then I’d just like money, to maybe save up and buy it myself. \n\nWell, no, everyone wanted to get me a name plate necklace instead. I’m not the biggest fan of jewelry, no matter how much my very feminine mother and grandmother would like me to, I just don’t see the big deal. I’ll wear big hoop earring if I want to look cute, but other than that I’ll just occasionally wear rings. Necklaces aren’t my thing, and I never see the real value of true gold or silver. \n\nI told that I definitely did not want that at all. I didn’t want anyone to waste their money getting me something I wouldn’t like, so I was very very adamant about nobody getting it. I said if they didn’t want to get me the phone that would be fine, but I just really didn’t want the necklace. So, for my birthday that year I got a violin, money, and the IPhone 6s+.\n\nThis year, however, I’m away from home at college. Less time for people to be around me asking me what i want. Nobody asked me what I wanted for my birthday. \n\nMy dad sent me a laptop that’s a slight upgrade from my old one, and my grandma sent me money. I liked the gifts a lot and thanked them. My mother had been excitedly telling me that she ordered my birthday gift and it should be there a few days after my birthday. I asked her what it was and she said she didn’t want to ruin the surprise. \n\nOn the day of my birthday, I get a notification that I have a package. I go to see what it is, and when I open it up, it’s a name plate necklace. A real gold name plate necklace with my birthstone in the center. I was confused because the only person who would get me jewelry knowing I’m not a big fan is my grandma, but she already sent her gift. \n\nTurns out it was from my mother. I’m extremely underwhelmed. To be blunt, I hate the necklace. I put it on to please her and just left it on so she wouldn’t complain about me wasting her money. I know it was extremely expensive but i hate it. I did say thank you and tell her it was pretty, and I didn’t tel her to her face that I hated it. \n\nWhen I mentioned it to my friend, she said I’m being spoiled and selfish because my mother didn’t HAVE to get me anything. I know she didn’t, but I wish she wouldn’t have got me anything rather than getting me a necklace that I told everyone a year ago that I did not want. AITA?\n\n****Edited for clarity****\n\nEdit #2: For everyone calling me a spoiled rich kid, I’ll admit the rambling about the iPhone did come off that way, but i started with that to show you guys things i am into: tech and music. \n\nI’m by no means rich. I don’t get random presents out of the blue, I don’t have a lot of things you might think i have. Originally i was going to mention that that year, my mom got herself the IPhone 7+ and gave me her 6s+ as a hand-me-down, saying her child should never have a better phone than her. So the phone was possible, I just didn’t get it because my mother wanted it. I didn’t throw a fit about that. I wanted an upgrade and i got one. \n\nThe reason I’m so torn is because i love my mom and appreciate that she got me something, but i just hate what i got. I know i didn’t have to get anything. I know that. Nobody asked me so I couldn’t expect to magically get what I wanted, but that’s the thing. She didn’t ASK. If i was adamant about not getting it last year, i just don’t understand why she would get it for me this year without asking if i had a change of heart. \n\nI never, ever, *ever* would tell my mother to her face that I hate the gift. She’s under the impression that I like it. I didn’t amplify my like of it either, I told her it was pretty and said thank you and I’m wearing it. That’s it.", "Me (21f) and my bf (25m) have been together for two years, we live together, and we see a long term future together. \n\nHis mom is a lovely woman, but very pushy. When I was 19 she told me she needed grandchildren in the next few years. My bf called her out for being hypocritical as she had him when she was 38, and he told her not to put pressure on me. However, this has only changed her approach in pushing grandchildren. She constantly talks about pregnancy, how having children younger is better, and (of course) how people should always stay close to their parents when they have kids. Something that is also hypocritical as she moved to a new country when she had my bf.\n\nWe are in no way planning to have children or get married anytime soon. My boyfriend even had another talk with her last week telling her that kids were at least 9 years away and she needed to stop. The next night she brought up pregnancy and kids again.  \n\nThis really stresses me out, and it's not only the idea of children, but how she talks about how children should be raised. She is very opinionated, believes any toy with plastic is just \"garbage,\" and doesn't believe in vaccinations. It gives me a headache to just think about having kids with her as a grandmother constantly breathing down my neck and criticizing my every parenting move.\n\nAND I'M ONLY 21!!!! I don't want to be thinking about this! Who knows if in 9 years children will even be the right choice for my partner and I! \n\nSo, the next time I see her and she brings it up I would like to mention that I do not want children. I'm hoping this would stump her a bit and if she protested it could be a good opportunity for me to draw clear boundaries that she has no right to tell me what to do with my future. It wouldn't be a complete lie as I really don't know what I will want in the future, but it feels a little deceptive and it might actually crush her...\n\nSo, my bf and I have decided to ask reddit WIBTA if I told her I didn't plan on having kids?", "First of all, we have very little exchange students in the college and the African or African-American people living in the country are also numbered. I started with that sentence because I think it will shed some more light into the boyfriend's mentality. The boyfriend (T) in question is a well-known casanova who takes his changes with almost every girl and about a month ago or so, he started dating an African-American exchange student (Y) who is hands-down gorgeous. Me and some of my friends couldn't really understand what she sees in him but didn't make any comments since it's none of our business and we were not that close with her anyways. We have a group chat which includes T and not Y yet we don't use it that much since it has all the people in our class and the subject is usually homework, exams, etc. The other day T sent a photo of him and Y to the group titled ''Proof'' of Love, he put the word proof in quotation marks and asked how they looked, it was odd but we still congratulated and didn't think much of it. And it went downhill from there, I was a little bit early for the lesson in the morning and was just checking some notes, T comes in cheerfully with some of his friends and they sit in front of me. They started making jokes about dark and white chocolate and which one tasted better etc. but I didn't get what they were talking about at that time. One of his friends said that he was taking it too far and he should just stop, he brushed him off and said ''Come on man, I already told you I'll break up with her as soon as I get some of that black pussy.'' I was shocked and said that ''This is too cruel even for you, T'' He just laughed and said it's none of my business. And yes, it isn't.   \n\n\nStill, it disturbs me a lot and I want to talk to Y. My friends think it's a shame yet still none of my business. WIBTA if I talk to the exchange student about what her boyfriend really thinks of her?", "My girlfriend is overly jealous most of the time. She accuses me of being a flirt and having girls fawn over my existence. According to her, I would have girls all over me in any situation. This is definitely not the case. My reunion is coming up in November. She wants to go “to make sure everyone knows I have a girlfriend”. She thinks that I am only going to see my “old fuck buddys” and doesn’t trust me to be by myself. I have never cheated on her. The only time in my life I have cheated was on a girl in HS and I made the mistake of telling my GF this. I have since matured and would never consider cheating again. I think she’ll just be pissed off the whole time and will be triggered by any communication I have at the reunion. I want to go to see my friends that I haven’t seen in over a decade. AITA for not letting her come with me since I think she’ll be pissed off the entire time?", "So this was last weekend for the first regular season game in the football season.\nMy mom has season tickets and I had my son who is 11 months old and wanted to take him to the game and asked my mother if she would take my son and me. So it was raining very bad out and I didnt want to take my kid on the public transit for how rainy it was and how young he was so we decided to drive to the stadium and park at the stadium. The second we got into the vehicle and started driving my mom started complaining saying we should have just taken the light rail and she doesnt want to pay for parking because she knows right now I'm not doing great financially and am living paycheck to paycheck with everything going on in my life. As we get closer she starts getting louder in the car and basically yelling at me for making her pay for parking. As we are on the highway about to get on to the main highway to get us to the stadium I have the choice of going north or south, north takes us to the game south takes us home and I looked at her and said,\" fine we don't need to go to the game so you dont need to pay for parking I can just turn around and we can go home\" she sits in silence for a second then continues to complain about how much she will spend on parking so at the last second I went south to go home which resulted in silence for the 25 min drive back to her house. When we got to her house I made the decision to just drop her off so when I pulled up she scoffs at me, gets out and slams my car door shut and makes a couple comments under her breath. I drove away and my son and me watched the game at a local restaurant.", "Tldr is basically title\n\nI’d like to start by saying this was a number of years ago, but it still bothers me. \n\nI used to go on Skype fairly often, and one night I got a message from a woman telling me she found my name in a random Skype search. We had a normal conversation for a while before she started gearing the conversation towards her being a cam girl. Once it reached this point I’d thought she was a bot, but our previous conversations were not bot-like at all. \n\nShe told me a story that her supposed “friend” got her into the business and she’d like me, a random kid on the internet, to watch her. I didn’t want to but she sent me a link to her “cam girl” site, but of course as you know this was really just an obvious virus link. \n\nI didn’t open it, but I gave her a request to “get off” on this certain “video” I like, and so I sent her a website link that’s a screamer. I got blocked immediately after, so I assume it was opened. \n\nAt first I thought it was funny, so I told a certain friend of mine about it, who did not find it funny at all. She went off and told me I was a sh*tty person, even if the woman WAS a bot that my actions were still unacceptable. Ever since I’ve really wanted to know, am I the asshole?", "This happened last Christmas but I kinda forgot about it until recently when we were making plans for this upcoming Christmas.\n\nSo the whole family went to my sister's house for Christmas day. This was planned ahead of time. Her husband is wearing only his boxers and is watching Stargate in the living room. Not like it's early morning and he just woke up when we got there this was like at noon. So I was talking to my brother about how that's pretty rude. And my brother says \"It's his house he can do what he wants.\" And everyone else agreed with him. But I think that only really applies if it's a casual thing. This was a big family event where they knew ahead of time they were hosting. Since I was the only one that saw an issue with it I'm curious if that makes me the asshole or if my entire family is insane."], "label": ["ESH", "YTA", "NTA", "NTA", "NTA", "NTA", "NTA", "INFO", "ESH", "NTA", "NTA"]}