{"title": ["AITA for confronting my ex about her cheating?", "Wibtah putting a condom in my girlfriends car", "AITA for waking up my roommate and his girlfriend in a rage?", "AITA for being rude to my doctor?", "AITA for hating my birthday present?", "WIBTA if I told my boyfriend's mom I didn't want kids?", "WIBTA if I talk to the exchange student about what her boyfriend really thinks of her?", "AITA for not allowing my (28M) gf (30F) to go with me to my High school 10 year reunion?", "AITA for turning the vehicle around on my mom going to a football game?", "AITA for sending a screamer to a woman who sent me a virus link?", "AITA for expecting my BIL to wear clothes for Christmas?", "AITA for wanting to hide a religious gift from my MIL?", "AITA for refusing to share my room with my sister because she came home last minute", "WIBTA if I tell my 12 year old daughter to watch \"Midsommar\" when it's out on DVD?", "AITA for ghosting a \"mentor\" for creeping me out?", "AITA for lying to my daughter about getting her from school early because she lied to me?", "AITA for selling my sister videogame (GTA 4)", "AITA for being upset that my bf claims his first kiss wasn't with me?", "AITA for not wanting to discuss anything too heavy while in the hospital?", "AITA for being pissed at my wife for going out to dinner", "AITA. My (20m) mother wants me to watch my 4 year old brother, but I keep saying no.", "AITA for being mad that my parents made me share my parking spot with my brother?", "AITA for not letting out of state family visit during my daughters birthday.", "WIBTA if i read a letter from my father that wasn't for me.", "AITA for not paying for camping food?", "AITA for saying that I didn't respect prostitution to a friend not knowing that her daughter is a prostitute", "WIBTA if I tell a teacher that one a classmate downloaded his homework from the internet?", "AITA for making my boyfriend’s favorite food while he’s on a “diet”", "AITA for leaving everyone I know because of my mental illness?", "WIBTA if I asked my parents for info about an estranged sibling, even if it upsets them?", "AITA for abandoning an older lady coworker at my job? WIBTA for trying to get her fired", "AITA for distancing my BFF who will always be better off or worse off than you.", "WIBTA if I told my roommates gf that he’s cheating?", "AITA for agreeing to have someone else’s baby for them without asking boyfriend?", "AITA? I ran away from home.", "AITA for losing my shit at my Dad when we were having an extended family dinner?", "AITA for snapping at a girl that rejected me", "AITA for wearing leggings to work?", "WIBTA if I don’t hand the last spot for a trip to a blind girl", "AITA for not attending a family trip to the beach because my Dad’s girlfriend is only 6 years older than me?", "AITA for making my brother in law include my husband in his wedding party", "WIBTA if I called CFS on my brother for being disgusting?", "AITA for insisting that my fiancé’s dad pays for his tuition?", "AITA for calling my SIL a liar when she wasn't around to defend herself?", "AITA for Rescinding a Job Offer Due to the Applicant's Unreasonable Accommodation Requests", "AITA For being pissed off at my parents for backing out of a deal we made?", "AITA if I told my wife I didn't think she was to blame for something, instead of I was certain she wasn't to blame?", "WIBTA for asking a man to shave his face before we vigorously make out?", "AITA for being stoic with a non-tipping pizza delivery customer?", "WIBTA for not telling my loving-but-transphobic parents that I'm starting hormone therapy?", "AITA: my 2 year old trashed one of my wife's sold funko toy", "AITA to think my MIL should pack her share when staying with us?", "AITA for not giving a girl in gym \"personal space\"", "AITA for being upset at my girlfriend for posting nudes even though I watch porn and look at nudes of girls on the internet?", "AITA for insisting my GF get a flu shot?", "AITA for not supervising my dog?", "AITA for walking out of a job interview over a ridiculous question?", "WIBTA if I asked my teacher to speak English?", "WIBTA if I returned my birthday gift from my fiancee?", "AITA for calling out a family at Chipotle?", "AITA for ditching my friend midway through a planned outing?", "AITA for making the neighborhood dogs bark?", "WIBTA if I Did Not Let My Autistic Sister Move in with Me?", "AITA for calling my boyfriend’s mother a bitch?", "WIBTA if I told a guy in my class why nobody wants to be around him?", "AITA for keeping my cat indoors?", "AITA for finally snapping at a customer", "AITA for annoyance with disruptive disabled person coming to public science lectures?", "WIBTA if I went camping with new female friends if my girlfriend can't go?", "AITA for being pissed off at my gf for not dressing appropriately to meet my mom?", "AITA for not properly comforting my friend who confessed to me?", "AITAH for refusing to see my sister and her family because I'm disappointed in her and have a low opinion of her as a person.", "AITA for having an option to help fund our honeymoon in our wedding registry?", "AITA for saying that my 7 y/o Niece having a Halloween / Birthday Party when her birthday is in January is weird?", "AITA for getting angry at my boyfriend [26M] for staring at someone else?", "AITA for not agreeing to pay back a loan to my father?", "AITA for thinking an autistic man is an entitled asshole?", "AITA for telling my friend something that potentially caused her more anxiety?", "AITA for throwing away half eating food in a nursing pod at a hospital?", "AITA for turning down her request for money for her 'dying' family members?", "AITA for demanding 1 conscious adult around my kids on weekends?", "AITA for not letting my little cousin smash a pinata", "AITA by not wanting my mother's husband (my step father) to refer to my child as his granchild?", "AITA for feeding my friends crickets?", "WIBTA if I just disappeared for a few days?", "AITA for keeping a car that reminds my wife of her brother's death?", "AITA for not wanting to name my son after my partner?", "AITA for telling my soon to be ex-wife no?", "AITA for creating a DnD Group after I was kicked out of my old group and destroying a friendship?", "AITA for telling a staff member not to touch me?", "AITA for bailing on a lake day with my autistic client and his siblings?", "WIBTA for not paying for my sister's legal/attorney's fees?", "AITA for saying my friends ethnic food was gross", "AITA for lying to a guy who ran out of gas and reporting him?", "AITA for always ordering kids meals ?", "AITA for taking my notebook away from someone who was licking her fingers before touching the paper?", "AITA for refusing to change?", "AITA for not wanting to drive my parents to the airport at 4:30 AM?", "AITA for causing a girl to injure herself at the gym", "AITA for telling my mum it's her fault I was overweight", "AITA for telling my female friend not to come to the bar I was at?", "AITA for buying a fleshlight when my girlfriends sex drive is low?", "AITA for spending less time with a girl after she rejected me?", "AITA for asking boyfriend to split the grocery bill 75/25 because he eats more than me?", "AITA for asking GF many questions about her sexuality and for feeling bothered by her exes being female?", "AITA for forcing my socially anxious fiancee to have a wedding?", "WIBTA for getting frustrated waiting for my bf to propose?", "AITA for hanging reminder signs to my wife around the house?", "AITA for pinning my neighbor's car in?", "AITA for outing a former FWB because he was homophobic?", "AITA for calling my gf (now wife) lazy at a cafe because she had the server move the salt and pepper shakers closer to her?", "WIBTA if I back out of my friend’s wedding due to her fiancé’s cheating?", "AITA for getting pissed off about my sister's wedding rules?", "AITA For telling my husband to \"stop leaving his clothes on the ground like a child\" while he was talking to people in his online game?", "AITA for talking to the prospective buyers of my neighbors house?", "WIBTA if I talked to my professor about leaving my group members who don’t speak English fluently", "AITA for getting angry in Best Buy over a broken TV?", "AITA for wearing an ugly shirt to meet my girlfriend's parents?", "AITA for being bitter about not getting invited to Nepal for a work event I managed?", "AITA for making a formal complaint of discrimination to a building manager, and threatening a lawsuit, for key-locking the men's room, but not the women's room?", "WIBTA if I told my ex-wifes husband to go away?", "AITA for blocking my best friend for shaming my girlfriend because she is chubby?", "AITA for not wanting to price match my friend on our vacation?", "AITA for ripping up flooring in an apartment I don't own?", "AITA for telling my SO she talks too much on the phone?", "AITA for asking my boyfriend to stop criticizing what I eat?", "AITA for getting a family kicked out of a movie?", "AITA for allowing my children to ride an Uber home from school alone?", "WIBTA if I asked for my tattoo deposit back?", "AITA for Telling My Twin Sister It Is Her Fault She Is Not Losing Weight", "AITA for taking a picture of an airline supervisor at the airport that was being rude to me?", "AITA for getting annoyed at my partner for taking calls from work at evenings and weekends?", "AITA for refusing to pay for damages done to a family friends house done by my dog?", "AITA for throwing away my boyfriend’s favorite sweatpants after I had diarrhea in them", "AITA not letting my friends put their phones in my purse after they didn't bring one themselves?", "AITA for not wanting to baby sit my sister's kids.", "AITA for not wanting someone who is going through a hard time to have 3 assault rifles in my home?", "AITA For Ruining My Family's Vacation", "AITA for trying to convince my friend join my church to help with her depression?", "AITA for getting a teenage employee fired from a grocery store?", "AITA for spoiling my special needs son?", "WIBTA if I confronted a girl in my class?", "AITA for not leaving a tip on a \"To Go\" order?", "AITA for leaving work on time, despite no one being scheduled to close?", "AITA for turning off my Amber alert?", "AITA My partner wants me to use my time off", "AITA for telling kids at my old High School that most teachers there are useless and that they need to depend on themselves?", "AITA for not warming up to my bf's new friend until I found out she was a lesbian?", "AITA for getting mad at my dad for cutting me out of his will?"], "body": ["I broke up with my ex a year and a half ago. We had been dating for over 4 years and out of the blue, she wanted to break up. I thought things had been going great. We had been talking about getting married and moving in together and all of a sudden, she wanted to end things. The day before, we had been making anniversary plans and when I called her the next day, she said we should cancel them and we should break up. I tried talking to her and even drove out an hour just to talk to her but she refused to give me any other information. \n\nNot sure if relevant, but she had closed off to me in the past and broken up out of nowhere. During those times, I tried really hard to reach out and try to resolve things but this time, I was just tired. So for about a year, I didn't talk to her and just felt shitty about the whole situation. A few months ago, I was hanging out with some mutual friends and they were telling me about her new BF. It's been like a year at that point. I\"m still a little sore about it but she can date whoever she wants. But as we're talking, I realize that their \"anniversary\" overlaps with the time when she and I were still dating for a period of a few months. I was devastated. \n\nOf course I minded the cheating but I was more upset that she didn't tell me THIS was the reason. I spent months blaming myself for ruining what I had perceived to be a perfect relationship. This made me really upset to the point where I fell into a little bit of a depressive state. I had doubts about ever finding someone and had panic attacks about how I could trust anyone in the future. \n\nRecently, I got back into dating and I'm reminded of this whole situation again and I feel like shit. So I had a guy's night out and got trashed. At the end of the night, I ended up texting her and telling her she should've just told me about it and that I know I know why she broke up with me. I realize it's been over a year and maybe I should've just moved on. But am AITA for bringing it up when she's happily moved on with someone else? (Side note, a few of my friends think they are getting engaged soon haha....)", "Wibtah, me(t) my girlfriend (j) and girlfriends sister(m)\n\nI’ve been with j for 4 years now, we’ve had our ups and downs and broke up for a week in that time, otherwise we’re happy. \n\nLast week m comes to me and says don’t tell j I told you this but, j’s been going on dates with another guy behind your back. I was upset but grateful m told me this. M did show me proof so it’s not just a sister fight, and no myself and m don’t have feelings for each other.\n\nI let this sink in and how I was going to confront j, I came up with the idea to leave a used condom in her car because that’s where she was fooling around with this guy. I figure I’d offer to detail j’s car one day and come across the condom and confront her this way so that m doesn’t get involved in a argument with j. I just want to make it look like j and this guy were careless and that’s how I found out. My brother thinks lying to j makes me an ass because he knows I hate confrontation and I want to take the easy way out. So am I a ass for setting her up?", "[removed]", "[removed]", "Last year for my 16th birthday, I really wanted an IPhone 7 or 8 because I was tired of my little 6s and wanted something nice for my big birthday. I made sure everyone knew what I wanted, and I said if it wasn’t that then I’d just like money, to maybe save up and buy it myself. \n\nWell, no, everyone wanted to get me a name plate necklace instead. I’m not the biggest fan of jewelry, no matter how much my very feminine mother and grandmother would like me to, I just don’t see the big deal. I’ll wear big hoop earring if I want to look cute, but other than that I’ll just occasionally wear rings. Necklaces aren’t my thing, and I never see the real value of true gold or silver. \n\nI told that I definitely did not want that at all. I didn’t want anyone to waste their money getting me something I wouldn’t like, so I was very very adamant about nobody getting it. I said if they didn’t want to get me the phone that would be fine, but I just really didn’t want the necklace. So, for my birthday that year I got a violin, money, and the IPhone 6s+.\n\nThis year, however, I’m away from home at college. Less time for people to be around me asking me what i want. Nobody asked me what I wanted for my birthday. \n\nMy dad sent me a laptop that’s a slight upgrade from my old one, and my grandma sent me money. I liked the gifts a lot and thanked them. My mother had been excitedly telling me that she ordered my birthday gift and it should be there a few days after my birthday. I asked her what it was and she said she didn’t want to ruin the surprise. \n\nOn the day of my birthday, I get a notification that I have a package. I go to see what it is, and when I open it up, it’s a name plate necklace. A real gold name plate necklace with my birthstone in the center. I was confused because the only person who would get me jewelry knowing I’m not a big fan is my grandma, but she already sent her gift. \n\nTurns out it was from my mother. I’m extremely underwhelmed. To be blunt, I hate the necklace. I put it on to please her and just left it on so she wouldn’t complain about me wasting her money. I know it was extremely expensive but i hate it. I did say thank you and tell her it was pretty, and I didn’t tel her to her face that I hated it. \n\nWhen I mentioned it to my friend, she said I’m being spoiled and selfish because my mother didn’t HAVE to get me anything. I know she didn’t, but I wish she wouldn’t have got me anything rather than getting me a necklace that I told everyone a year ago that I did not want. AITA?\n\n****Edited for clarity****\n\nEdit #2: For everyone calling me a spoiled rich kid, I’ll admit the rambling about the iPhone did come off that way, but i started with that to show you guys things i am into: tech and music. \n\nI’m by no means rich. I don’t get random presents out of the blue, I don’t have a lot of things you might think i have. Originally i was going to mention that that year, my mom got herself the IPhone 7+ and gave me her 6s+ as a hand-me-down, saying her child should never have a better phone than her. So the phone was possible, I just didn’t get it because my mother wanted it. I didn’t throw a fit about that. I wanted an upgrade and i got one. \n\nThe reason I’m so torn is because i love my mom and appreciate that she got me something, but i just hate what i got. I know i didn’t have to get anything. I know that. Nobody asked me so I couldn’t expect to magically get what I wanted, but that’s the thing. She didn’t ASK. If i was adamant about not getting it last year, i just don’t understand why she would get it for me this year without asking if i had a change of heart. \n\nI never, ever, *ever* would tell my mother to her face that I hate the gift. She’s under the impression that I like it. I didn’t amplify my like of it either, I told her it was pretty and said thank you and I’m wearing it. That’s it.", "Me (21f) and my bf (25m) have been together for two years, we live together, and we see a long term future together. \n\nHis mom is a lovely woman, but very pushy. When I was 19 she told me she needed grandchildren in the next few years. My bf called her out for being hypocritical as she had him when she was 38, and he told her not to put pressure on me. However, this has only changed her approach in pushing grandchildren. She constantly talks about pregnancy, how having children younger is better, and (of course) how people should always stay close to their parents when they have kids. Something that is also hypocritical as she moved to a new country when she had my bf.\n\nWe are in no way planning to have children or get married anytime soon. My boyfriend even had another talk with her last week telling her that kids were at least 9 years away and she needed to stop. The next night she brought up pregnancy and kids again.  \n\nThis really stresses me out, and it's not only the idea of children, but how she talks about how children should be raised. She is very opinionated, believes any toy with plastic is just \"garbage,\" and doesn't believe in vaccinations. It gives me a headache to just think about having kids with her as a grandmother constantly breathing down my neck and criticizing my every parenting move.\n\nAND I'M ONLY 21!!!! I don't want to be thinking about this! Who knows if in 9 years children will even be the right choice for my partner and I! \n\nSo, the next time I see her and she brings it up I would like to mention that I do not want children. I'm hoping this would stump her a bit and if she protested it could be a good opportunity for me to draw clear boundaries that she has no right to tell me what to do with my future. It wouldn't be a complete lie as I really don't know what I will want in the future, but it feels a little deceptive and it might actually crush her...\n\nSo, my bf and I have decided to ask reddit WIBTA if I told her I didn't plan on having kids?", "First of all, we have very little exchange students in the college and the African or African-American people living in the country are also numbered. I started with that sentence because I think it will shed some more light into the boyfriend's mentality. The boyfriend (T) in question is a well-known casanova who takes his changes with almost every girl and about a month ago or so, he started dating an African-American exchange student (Y) who is hands-down gorgeous. Me and some of my friends couldn't really understand what she sees in him but didn't make any comments since it's none of our business and we were not that close with her anyways. We have a group chat which includes T and not Y yet we don't use it that much since it has all the people in our class and the subject is usually homework, exams, etc. The other day T sent a photo of him and Y to the group titled ''Proof'' of Love, he put the word proof in quotation marks and asked how they looked, it was odd but we still congratulated and didn't think much of it. And it went downhill from there, I was a little bit early for the lesson in the morning and was just checking some notes, T comes in cheerfully with some of his friends and they sit in front of me. They started making jokes about dark and white chocolate and which one tasted better etc. but I didn't get what they were talking about at that time. One of his friends said that he was taking it too far and he should just stop, he brushed him off and said ''Come on man, I already told you I'll break up with her as soon as I get some of that black pussy.'' I was shocked and said that ''This is too cruel even for you, T'' He just laughed and said it's none of my business. And yes, it isn't.   \n\n\nStill, it disturbs me a lot and I want to talk to Y. My friends think it's a shame yet still none of my business. WIBTA if I talk to the exchange student about what her boyfriend really thinks of her?", "My girlfriend is overly jealous most of the time. She accuses me of being a flirt and having girls fawn over my existence. According to her, I would have girls all over me in any situation. This is definitely not the case. My reunion is coming up in November. She wants to go “to make sure everyone knows I have a girlfriend”. She thinks that I am only going to see my “old fuck buddys” and doesn’t trust me to be by myself. I have never cheated on her. The only time in my life I have cheated was on a girl in HS and I made the mistake of telling my GF this. I have since matured and would never consider cheating again. I think she’ll just be pissed off the whole time and will be triggered by any communication I have at the reunion. I want to go to see my friends that I haven’t seen in over a decade. AITA for not letting her come with me since I think she’ll be pissed off the entire time?", "So this was last weekend for the first regular season game in the football season.\nMy mom has season tickets and I had my son who is 11 months old and wanted to take him to the game and asked my mother if she would take my son and me. So it was raining very bad out and I didnt want to take my kid on the public transit for how rainy it was and how young he was so we decided to drive to the stadium and park at the stadium. The second we got into the vehicle and started driving my mom started complaining saying we should have just taken the light rail and she doesnt want to pay for parking because she knows right now I'm not doing great financially and am living paycheck to paycheck with everything going on in my life. As we get closer she starts getting louder in the car and basically yelling at me for making her pay for parking. As we are on the highway about to get on to the main highway to get us to the stadium I have the choice of going north or south, north takes us to the game south takes us home and I looked at her and said,\" fine we don't need to go to the game so you dont need to pay for parking I can just turn around and we can go home\" she sits in silence for a second then continues to complain about how much she will spend on parking so at the last second I went south to go home which resulted in silence for the 25 min drive back to her house. When we got to her house I made the decision to just drop her off so when I pulled up she scoffs at me, gets out and slams my car door shut and makes a couple comments under her breath. I drove away and my son and me watched the game at a local restaurant.", "Tldr is basically title\n\nI’d like to start by saying this was a number of years ago, but it still bothers me. \n\nI used to go on Skype fairly often, and one night I got a message from a woman telling me she found my name in a random Skype search. We had a normal conversation for a while before she started gearing the conversation towards her being a cam girl. Once it reached this point I’d thought she was a bot, but our previous conversations were not bot-like at all. \n\nShe told me a story that her supposed “friend” got her into the business and she’d like me, a random kid on the internet, to watch her. I didn’t want to but she sent me a link to her “cam girl” site, but of course as you know this was really just an obvious virus link. \n\nI didn’t open it, but I gave her a request to “get off” on this certain “video” I like, and so I sent her a website link that’s a screamer. I got blocked immediately after, so I assume it was opened. \n\nAt first I thought it was funny, so I told a certain friend of mine about it, who did not find it funny at all. She went off and told me I was a sh*tty person, even if the woman WAS a bot that my actions were still unacceptable. Ever since I’ve really wanted to know, am I the asshole?", "This happened last Christmas but I kinda forgot about it until recently when we were making plans for this upcoming Christmas.\n\nSo the whole family went to my sister's house for Christmas day. This was planned ahead of time. Her husband is wearing only his boxers and is watching Stargate in the living room. Not like it's early morning and he just woke up when we got there this was like at noon. So I was talking to my brother about how that's pretty rude. And my brother says \"It's his house he can do what he wants.\" And everyone else agreed with him. But I think that only really applies if it's a casual thing. This was a big family event where they knew ahead of time they were hosting. Since I was the only one that saw an issue with it I'm curious if that makes me the asshole or if my entire family is insane.", "Background:\n\n~ I was raised Catholic, but also had a lot of superstitions and folk magic as I have a very old school mexican family. \n\nDuring my childhood, we moved to a new church that was closer, there we were shunned and socially judged because of these beliefs. The judgement from this congregation tore deep rifts in my family which still has effects lasting today. All in all, we were all hurt badly, and avoid religious things because of the bad memories. (I think we have PTSD..... not joking, it was seriously bad but in not going to go into it)\n\n~ Me and my MIL have a tenuous relationship, and she knows the whole story about my family past since she and my mother were once very close friends.\n\nStory:\n\nMy husband had his birthday recently, and his family came over to treat us to dinner. With them they brought a card and a big box (duh it's a birthday right?), well inside wasn't a normal gift but a huge crucifix. \n\nHis mom is religious and only recently started going back to church, so now shes all about it.\n\nThe crucifix is okay, but I think it came from a bad space as she knows the whole story about my family and the hurt but decided to give it to us anyways. So I believe it has some passive aggressive I'll intent. \n\nAlso it's just inappropriate as her son isn't religious at all. He literally doesnt care. \n\nAm I the asshole for not wanting something hanging in my home that gives me bad memories and was given to me by a person who knows the history and actively tries to throw wrenches in me and my husbands husband's relationship?", "[deleted]", "My daughter has complained a few times recently and gotten annoying about not letting her see R-rated movies (like the recent Child's Play remake and the It movies).\n\nI'm thinking about getting the DVD for this one once it's out and telling her to go watch that as a sort of \"scare them straight\" thing. I'm frankly amazed this movie in its form got an R rating and didn't require edits to go below NC-17. I could tell that the adults in the theater were unnerved and distressed.\n\nAnd then if she has such a reaction I could tell her \"well you told me you wanted to see R-rated horror movies!\"\n\nToo asshole of an idea?", "This guy is roughly 65-70, and is a casual acquaintance of my mom's (she doesn't really see him if she doesn't want to). I just graduated college and he just retired from the field I got my degree in.\n\nMy mom got us in contact with each other and he took me to several places around my city to meet people working in my field. He kept asking me my political views on things like gay marriage, marijuana etc.\n\nOnce he figured out I was a Democrat he told me that he was gay. Whatever. NBD. This is in a VERY red state mind you, so big risk I guess. \n\nWhat was the problem, was that after this, he started asking me about my sex life, whether I watch porn, weird stuff like that that made me really uncomfortable. He also kept calling me his \"special friend\" because I was one of only a few people who knew he was gay.\n\nAnyway I got really creeped out about all the really personal questions, and I stopped texting him and going places.  He texts me every week or so asking for updates on the job search, and also my parents are telling me to thank him for taking time out of his day to show me around.\n\nI don't want to out him obviously, but I also don't know how to explain that I was very creeped out.\n\nSo I guess AITA for ghosting this dude?", "[removed]", "So this happened a few years ago and I still wonder if I was TA on this one, I was about 22 and sister 24. I got in a situation where my bank told me that my account was in negative for too long and I got basically 3 days to fix it or face registration on the bad payers list (interdit bancaire). Here, in France, it's really impacting, you basically can't get a credit card anymore for a few years and have tons of paperwork to do. So, here I was, a student with no money and parents in holidays so, no way to get anything from them in time.\n\n\n\nSo I had to sell something, I posted an add on Craigslist equivalent to sell my PS4, did not really thought about it but posted the add with full package, all my videogames and my 2 controllers for 350 euros (like 390$). A guy took it and I put everything in my account. Thing is, one of the games belonged to my sister, GTA5. She never owned a PS4, only used mine for years and no longer lived here. So I did not really think about it but when I told here she got pissed, like really pissed. She did hold a grudge for a long time. I ended up buying her the game back for Christmas (might be an A for this one as she did not ask for it) even if she did not own a PS4. She bought one later though. So am AITA on this one?\n\n\nEdit: was GTA5, not the 4\n\nEdit 2: looks like the votes are going one way. So it was an honest mistake but I should have bought it back to her right away (or give her the money) and not make it a petty revenge on Christmas. Thank you for your votes.\n\nFinal edit/update: I decided to double gift her this Christmas and will apologize. Your input helped me figure out I was in the wrong there.", "[deleted]", "Note: I'm older (late 40s) but I guess you're never too old to be an asshole, or at least wonder if you are.\n\nMy girlfriend and I have been together for about 10 months. I'm divorced and she's a widow if it matters. I work a lot to pay for alimony and to put my kids through college. \n\nShe says that we don't see each other enough and she's probably right so it's not too important to go over that.\n\nAbout a week ago I wasn't feeling very good and she suggested that I go to the emergency room. While I was there the doctors discovered that I had a pretty bad infection which would require a lot of antibiotics. There was also some question as to whether I had a larger problem such as sepsis or even a massive infection in the bloodstream. Needless to say, I was worried.\n\nWhile we were making small talk or discussing what might be wrong with me she decides to bring up, once again, that we don't see each other enough and that she doesn't feel all that connected. I told her that I agreed we don't see each other enough but that I couldn't really talk about it.\n\n\nThe next day, she asks if I wanted her to come visit. I know from experience that once she's brought up not seeing each other enough she's going to keep bringing it up every time we are together until we talk about it. So I told her that I would love her to come see me, but that I didn't have the strength to talk about anything too deep. She replied that she would be able to visit but that she couldn't promise that she would be able to avoid the subject of our relationship. I repeated that I would love to see her but that if the conversation turned to anything heavier than work or friends then I would not be able to carry on a decent conversation but that I could talk about it when I was out of the hospital. I did say that if there was anything else on her mind (work, her elderly mom, etc.) I would be glad to talk about that but that my tank was already running pretty low and I wasn't sure what good I'd be. \n\n\nShe then said \"I guess you don't want me to visit then.\" I felt like I was being manipulated a bit so I replied that if that was how she wanted to look at it then OK. She didn't visit for the 3.5 days I was there.\n\n\nAITA for not wanting to talk about anything so draining while I'm in the hospital?", "[deleted]", "I currently am inbetween jobs and this summer I worked for my farther at his tree company. The days are long and hard.\n\n I don't ask to be paid because they take care of my bills and I live rent free at a house on my grandparents poperty which is 7 miles away from my parents. Plus I come from a family of 7 so I know they need the money.\n\nFootball season is coming up at she keep insisting that I watch my brother since he is so unbearable to have at the game. \n\nI came home today after a long day and I find her there with my brother and basicly told me to watch him till 10-11pm. She has done this before for other things aswell.\n\nI am tired from working all day and just want to relax. I told her she can't keep relying on me and that I had other plans. I stormed out of the house and im not sure what to do. \n\nI know she has done alot for all of us, but I cant just have him dumped on me. I am an adult and I shouldn't have to take care of him. \n\nAm I the asshole for not wanting to watch him?\n\n\n**update came back inside to find him alone with my 11 year old brother. Looks like I'll be watch them.\n\n**edit I work for them for free. I could easily pay my bills if I asked for money. I know they're in a rough place so I know they need the extra money.\n\n**edit She doesn't watch him all day because he in daycare till 5. I feel that she just doesn't enjoy watch him. Weekends he's at my house aswell.", "[deleted]", "Little background. I HATE my birthday, I have always hated it and probably always will so I take special care to make sure that my daughter will not. Growing up something was always more important than my birthday, and while I realise that I sound like a little shit, it's also taken its toll over the years on my relationship with my sisters and mother. My Dad always made sure that I had at least one thing that would make me smile that day but he passed away in 2012, never getting to meet my daughter, who was born in 2014. To add on to that my life long best friend was killed in 2016 and my Grandmother passed this past Christmas. I do not get along with my mother or sisters, but they are the only family I have left and they all live in Ohio. I live in North Carolina and my in-laws all live in Pennsylvania. \n\nFor my daughters first birthday I had a small party for her at home, but was told to plan two parties...the one at home and the one my sister-in-law was throwing in PA. That's an 8 hour drive away. My husband's family has a lot more money than my family and it is painfully obvious. So now I have my  butthurt mother and sisters up my ass because I didn't throw a third birthday party in Ohio, because \"it's not fair\".  This stressed me out so badly that I said that from now on there will be no traveling or no visits during her birthday. I want to worry about her birthday and not the back and forth saltiness between the two families. \n\nWe don't have room in our house for more than one person to stay here and the closest hotel is over 20 miles away. I made this rule in 2015 and yet every.... single.... year they still make passive aggressive jabs at me for being selfish and not letting them railroad me into taking over her birthday. I said they can come the week before or the week after Halloween, but not the week of and it's just not good enough. I'm at a loss and I'm starting to hate her birthday too. Am I the asshole for just wanting my child to have a day that is all about her?", "I'm a first time poster on this subreddit and not a native speaker.\n\nSo first the backstory. My mother had me while on drugs all her pregnancy. I came out normal tho. She got my father into drugs and beat him sometimes. My mother didn't do shit for me. After my father left I was all alone. I knew he loved me at least a little because he tried his best to give me a better life. He drove me to the hospital after my mother left me lying on the floor wit a broken leg. He said in court he's no good father but neither is she so I should go to my grandparents. Wich I did with my little sister of course( for who I cared for my entire life up to that point) My grandparents are giving me a really good life even if they sometimes compare me to my mother when they're angry and I can't blame them. They were being stolen from and lied to. My mother is not allowed to have contact with me and sis. She is living her best life with my other shit grandparents. My father on the other hand is allowed to have contact but hasn't talked to us in like 6 years. We came to our grandparents 8 years ago. \n\n\n\nSo now my grandma received a letter from him. And I just wanna know how he's doing and what's in it. I had dreams about him and cried at night because I miss him. So reddit would I be the A if I read it ? My grandparents say I will get hurt.\n\nEdit: he drove multiple times around my house but never had the courage to ring the bell. He is now in prison since this year. I am honestly not surprised. \nEdit 2 : in the letter he adressed me too. \n\nTldr my father who I have no contact with since 6 ago wrote a letter to my grandparents and I wanna read it.", "So, as a preface this happened last month. Also, my first post:I went camping with a few friends that were in town. We were camping for one night and hiking the next day. There were 5 of us total, me and two couples. We all decided that we would let one person buy all the food and split the food costs evenly. This was one dinner meal, one breakfast meal, some snacks, and beer. When we arrived (I should also note, I drove 3 hours each way in my car in the Rocky Mountains) I asked the friend who purchased the food, lets call him James, how much I owed them in the split, and they said evenly it would be $50.\n\nNow, I'm no scrooge and I'm always happy to pay my fair share, but I felt that this was a little steep considering we were eating burgers, pancakes, and drinking coors lite for only one night. I asked to see a receipt. Turns out, the bill for everything was $150, and we just had a lot of nicer products. Jame's wife is a vegetarian and had her own separate food included in the bill, and I'm happy to help with her food as well, but it definitely added to the cost.Here is where I take issue. The bill was split 3 ways, 1/3 James and his wife, 1/3 the other couple, 1/3 me by myself. My wife was not with us because she had to work, and I felt that it was unfair that I was expected to cover 1/3 the bill while the other two paid \"as a couple\" instead of individually.\n\nI was bothered by this and brought it up, explaining that it wasn't exactly even, but I was told by both couples that it made sense to them. Their logic was because James was paying, and the other male was paying, the women shouldn't have to. Normally, I'd be chivalrous and agree, but my wife wasn't there, so I don't think that it makes sense. I offered to pay $30, which would have been 1/5 the costs instead of 1/3, but they all said I was being ridiculous.\n\nAm I the asshole for not agreeing with this split?\n\n&#x200B;\n\nEdit for clarity: My wife was never intending on coming on this trip, she clearly told everyone she had to work. So it's not like they did the math beforehand and decided to charge me.", "Today I had lunch with a group of friends, we're all in our 40s. The topic of the conversation somehow got onto prostitution, I'm still not entirely sure how. One of my friends started saying how awful it was that people don't respect prostitutes. I said that I respect the people but not the job, sort of like how you can respect a sweatshop worker but not the job of being a sweatshop worker.\n\nShe got really upset and said that her daughter was a prostitute and I was really rude. I knew she had a daughter but had no idea that her daughter is a prostitute. My wife thinks I should have just kept my mouth shut, but agrees with my position on the matter. Is she right?", "Some context of why I don't like this guy besides the obvious.\n\nWe are in a private University, my classmates mostly come from upper middle class families for them to be able to afford this school.  My classmates are around 22 years old while I am older than them since I had to pay for school my self cause I am from a lower class family.\n\nThere is the geeks and quiet ones who tend to be the most hard working ones, and theres the upbeat undiciplined ones but are more social so they will most likely turn okay in life after school anyways.\n\nI had never ever talked to this classmate, but had already judged him based on what I saw from him.  He is lazy, doesnt go to most classes, he wants to be social but people find him annoying.   He is not good with girls.  I guess his goal in life is to not work and be popular.  A teacher once told him he will give him permission to get out of class and not get an absence if he wanted to just leave, and he did get out.  I am guessing he will just live off his parents when (if) he graduates.\n\nI just resented him since due to my economic status it took me years to finally start Collegue and this dude with all the resources is being a waste of space, but anyways I never thought much about it till today.\n\nWe had an assigment for last week we had to turn in today, which was making a 3D  helmet, which I took my time making it so it will be good,  some classmates did it quick and meh, some did took their time and looked great.\n\nSo that classmate was sitting close to me,and was bragging that he got an A for that assigment and that he basically looked for a 3D model of the helmet from the internet and just uploaded it as his work.\n\nIt just pissed me off how he has no shame and how a might get an A too for far much more work that what he does.\n\n&#x200B;\n\nWould I be an asshole if I let my teacher know he just downloaded the model?\n\nHe will most like get a DA(diciplinary action).  If you get 2 of those you are out.\n\nYou think I am just being petty?\n\n&#x200B;\n\n&#x200B;\n\nedit:  Ok well, opinions seem divided but mostly seem to agree he should had been reported but my personal feelings got involved\n\nI agree with the ESH", "My(24m) boyfriend(20m) is really skinny. He has fast metabolism so he doesn’t gain weight easily at all. \n\nHe’s walking on a fashion show soon, so he said he’d eat healthy and get on diet. By eating healthy and getting on a diet he meant replacing meals with cigarettes and energy drinks/coffee. He has been doing it for a week already.\nYesterday I made his favorite food. He loves it and I know he’d eat it no matter what. So he got home, saw the food and got really upset. He said that I was trying to make him fail, I could’ve made something healthier if I was worried about him. He’s still mad and won’t talk to me.", "Posting for a friend that doesn't have reddit, but still wants to know if she was the asshole. \n\nShe (26F) has been diagnosed with loads of different mental health issues including BPD, Bipolar 1, PTSD, MDD, panic disorder, and anxiety. \n\nShe and her boyfriend (27M) were together for seven years. Their relationship was great, until her mental health started getting worse. She tried for \\~2 years to go to therapists, get medication, try natural remedies, everything. Nothing was helping her, and she and her boyfriend were constantly fighting over everything, even the stupid shit. So she broke up with him. Paid off the rest of their lease and immediately left. \n\nShe fought with her family and friends often because they all believed she could get better (or, in some cases, that mental health doesn't exist). She didn't want their help, because they had all recommended different inpatient facilities and therapists that turned out badly. So she stopped talking to all of them, changed her phone number and address, and left. \n\nShe doesn't have any reason to talk to her friends, ex, or family (i.e. no co-signed loans or leases, completely independent, etc), but they all think she's the asshole for leaving and not working on herself more. I'm a new friend that she told all of this to, so I'm not part of the situation that much, but enough that I can't make a judgement call.", "This could easily get too long, so I'll try and keep this concise.\n\nBefore my parents married, my Dad was married to a different woman with whom he had a son. They divorced, he remarried, and they had my siblings and I.\n\nWhen I was a kid and heard that I had a brother for the first time, I was really curious. I asked about him and was basically told that their relationships turned sour about 30ish years ago and he had cut Dad out. Since then they had all pretended the other didn't exist. I was given zero detail about why this had come about.\n\nAbout 10 years ago, the brother reached out and asked me/my siblings if we wanted to get to know him. I was delighted, but the rest of the family discussed it and decided they didn't have any interest in the brother.\n\nI was an awkward teen at this point, and asked my parents if it would be ok if I just spoke to my brother. I said I had always been curious. Their reaction was fury and upset - my Mom burst into tears and said that my brother would 'turn me against the family' and they would 'lose me forever'. Being a teen I didn't really know how to react, so I reassured them that I wouldn't get involved. The brother's message went entirely ignored.\n\nThing is, I still want to know him. I know nothing but a name. I could have nieces and nephews out there, a whole family I've never met.\n\nNow I'm much older, I tried to find him myself. Just to say hi and let him know I'm here and happy to speak if he wants to. I'm pretty sure I found him on social media, and reached out with a simple, polite message. He blocked me.\n\nI'm sad about it, but I understand. Being soundly rejected a decade ago, of course he's moved on and doesn't want to get hurt again. It only intensified my regret at not standing up for myself as a teenager and reaching out.\n\nI suppose I should move on, given the circumstances, but I'm still curious. I don't want to grow old regretting never knowing a single thing about my eldest sibling. I'm scared of this mystery weighing me down for the rest of my life.\n\nI want to ask my parents more about him. Not much, just a little. Just so I have more than a name for the brother I'll never meet. I feel like I have the right to know a little something about my brother.\n\nBut it's clearly painful for my parents. I adore my parents and would never want to hurt them, but I worry that dredging up painful memories will do just that. I've asked some friends and opinions seem split between I have a right to know about my sibling, and that my parents have kept us apart for a reason and it's not my place to ask why.\n\nSo, WIBTA if I asked them to tell me a couple of stories about my estranged brother?", "[deleted]", "Whatever accomplishment I'm proud of (I'm 22F) she has done it **BETTER** (also 22F). Whatever lousy, shitty situation I'm in she's **WORSE OFF**. But we're really good friends and I also heard from another friend of hers, that that was the reason they had an argument, my bestfriend basically has to always either be doing better than you or her life was entirely worse than you and somehow every subject revolves around her.\n\n*\\*insert 'completed it' by Jay from Inbetweeners\\**\n\nOh you earned £££? well I earned ££££ with commission. Oh you earned more this month? That's not right. SHE LITERALLY REJECTED THE IDEA THAT ONE MONTH I MADE MORE THAN HER AND BLAMED IT ON HER OUTGOING PAYMENTS.\n\nShe accused me of lying about my wages for the month because she earnt less. We both have office jobs, different positions/companies.\n\nAlso, note, I have Epilepsy and by chance her Father has epilepsy. I was telling her about a seizure I'd had a few weeks ago back and how I was just so tired but still made it to the gym, and somehow she was within seconds discussing the time she \"nearly had a seizure\" and got tested for it years ago despite no proof? and how embarrassing the whole experience was and how she was more prone to seizures than most. **I have E P I L E P S Y?** I've had a seizure during an exam? And she fails to acknowledge that too.\n\nYES, she has mental health issues and I do not, I am distancing myself away from one of my closest friends as it first I didn't notice this behaviour but in a conversation I was telling my mom how much weight I'd lost and lifted at the gym and all of a sudden she piped up with her better weight loss and how she can lift more.\n\nI talked about a shitty day at work on the way to the gym and surprise, she didn't acknowledge but instantly despite asking her earlier when she picked me up, somehow she forgot to mention how her day was far worse.\n\nAm I the asshole for distancing myself and slowly pushing her away?\n\nOne of her old friends (23F) did the same thing to her before we started speaking, but I know that girl and she is also an asshole. Am I just an attention seeker? I feel bad because she does really well but when I have done something better than her she gives me the silent treatment or accuses me of lying!\n\nBut she does have mental health issues and I'm just being an asshole for not learning more about mental health, maybe it's a cry for help and acceptance for validation?\n\nEDIT : I don't know how to not be her friend, she's not always like this there will be a week where it's fine and then it picks up. I'm usually a very strong minded person but I just sit and listen and will sometimes lie to make myself upto her level. I also try to avoid talking about her mental health as the last conversation.. got very aggressive between us both NOT GOOD.", "My roommate is a jackass: he’s 25, grows and sells weed, steals from me, and makes a huge mess all the time. He lies about everything, and brags about how he cheats on his girlfriend (whom I’ve briefly met and seems like a nice person) and always brings other girls home. He tells these girls that he broke up with his gf, but he hasn’t.\n\n\nI’m tired of his behaviour towards me and everyone, and having been cheated on myself, I hate seeing someone who is seemingly innocent get cheated on. I’d like to tell her anonymously. Should I do this or stay out of it and deal with his bs until he or I move out? Moving out isn’t a current option for whoever suggests that. \n\n\nWIBTA?", "My sister asked me (she cannot have a baby) whether I would have a baby for her. I said yes. My boyfriend immediately became angry because I didn’t ask him about it first. \n\nConsider: she was not asking for OUR baby. She did not want mine or my boyfriends genes. She wanted her and her husband’s baby, inside me. She has a medical condition where pregnancy may kill her. \n\nI don’t think my boyfriend should have ANY say over what I do for my sister with my body. I would not be cheating on him, no sex involved in this pregnancy. It would be done medically. Then they get the baby. No responsibility on us other than I stay healthy. He’s just mad that I would say yes without asking because he “will have to deal with the pregnancy.” He doesn’t want my body to change as it does with pregnancy and he doesn’t want to deal with my mood swings because of hormonal changes. \n\nI think he’s the asshole for thinking he has any right to say what I do with my body. He thinks I’m the asshole for not considering him with what I do with my body. Even if it’s for my sister, the person I am most close to and if it ever came to it, I would end the relationship with him if given an ultimatum. So either way, she’s going to get a baby. Why do I even have to ask if what he says literally doesn’t make a difference?\n\n\nUPDATE: to respond to questions, I have not had children before. We are not long distance, we live together. He was in the room when my sister asked, I didn’t come home and say “I’m getting pregnant” but he knows that this is really important to me and how close I am with my sister. I am positive that if the roles were reversed, she would do the same for me, and I just felt like yes, you’ll have to deal with me pregnant if you want to stay, but I don’t think I should have waited to respond to my sister because ultimately, what happens with my boyfriend and I because of it wouldn’t affect my decision.\n\nAdditional UPDATE: Boyfriend and I are both young twenties. We've been together less than three years. If I was married to him and already committed to sharing my life with him, I may have paused. But saying this again: He was in the room and immediately got mad with me for responding. It wasn't that I had time to think about say \"ew fuck him,\" but I did know that I would NOT be refusing to have a baby for my sister. The details of the, where, how where not hammered out. I could have very easily agreed to wait to have my own kids first and then have hers. May have sped up both of our timelines but she means the world to me. I was pissed that he was pissed before even considering it. To who said I was putting a spin on it, absolutely not. His two reasons were mood and my body changing, which is the literal reason I think that even after considering his opinion, I don't care. Yes those are valid and will happen to me, but I think it's a bs reason to not want someone to do it. \n\nIt seems like the general consensus is that I am a raging bitch. Although I -still- say I would obviously prefer his support, his lack of support will not change my mind. Legally/medically, if I have to wait or have a kid first, So Be It. I honestly think that has no bearing on whether my decision was bad or not. It wouldn't have made it any less of a dick move if it was allowed without me having kids first, would it? Also- sister and husband would be paying all bills, supplements, maternity clothes, etc. I love the hell out of him but I've been in relationships before where people stopped me from doing things and having a life and I swore that it would never happen again, no matter how smitten. Maybe I over-corrected this attitude. \n\nBut things I did begin to consider that did not cross my mind (honestly, thank you, internet)\n1) He may want to experience pregnancy for his child first and I could potentially be depriving him of a special thing to him. I've only been considering the fact that he wants to deprive my sister of motherhood. I didn't think about him missing out on the \"firsts\" of pregnancy. \n2) Did not consider the fact I might not be able to work. I have known pregnant people and they dip out of work right before giving birth and wait a bit before coming back. However, my sister offered to let us live with her during the pregnancy. She was never going to be not heavily-involved. Nothing is expected of boyfriend in this situation except to let me do it without being callous. So I don't think money has a real issue here for him although I know it's a factor for my sister. \n3) Even though his opinion wouldn't change whether I would ultimately do it or not, he may have felt like his opinion in other things would not matter because of how quickly I replied to this situation. I agree I would not bring home a pet without talking to him. But I would never tell him whether or not to help out a family member, REGARDLESS of how it inconvenienced me. I do not think romantic relationships should dictate your relationship with everyone else. Sure, they can affect them, strain them, strengthen them. But whatever boy I am dating (I feel) has no right to protest MY sister's baby inside ME. I get that I'm asking a lot of him already to stick around. But I'm also ok if we DID put our relationship on hold because he didn't want to \"deal\" with my hormones and body.\n4) It may not be WHAT decision I made, but HOW I made the decision. Even if I value my sister's relationship more than mine with him, responding immediately just pulled it out into the open and threw it into his face when I could still have made the decision, but gentler for him. \n\nHope that doesn't count as arguing, not discounting anyone's opinion and I appreciate everyone who replied, even the ones who think I deserve to be alone for life. It gave me perspective because apparently other people (namely boyfriends) can legitimately feel entitled to parts of my life that I think they should have no say in. Just makes me rethink some other decisions I've made without asking. You're probably right that he puts up with a lot of shit to date me. I'm stubborn and argumentative and act before thinking. I'm emotional and passionate and respond how I honestly feel, but I don't act maliciously, even if I don't take the care to make sure I don't hurt whoever is around me. My assumptions skipped a lot of steps that would have been good to think about: like yes even though I WILL do it, I should give him notice. Give him the option of leaving or moving out before I do it. Or honestly, give him the option of finding someone else to have kids with and live with if he doesn't accept my faults (like impulsivity- working on it but obviously not very good at controlling it yet) like I accept his that can annoy me, although the point of this post is not to point out what's good and bad in both of us- it's a very isolated, Am I the Asshole, which apparently I am. Yikes.", "Today I went to work at parents restaurant, first thing they did was screaming at me why I couldn't come sooner. After so many times I just flipped out I screamed at them. Told them I said three weeks from before that I had a birthday and couldn't come in and that I now would go later in the night. My mother yelled at me for being an useless son and that I should always be ready to work because it's so busy in the weekend my father did they same and I just lost it at that point. I told them if they didn't want me so much that I would leave. My mother just screamed just do it then I don't need you, my father kept telling me just to go to work and that I should keep my mouth shut and apologize for being so rude. \n\nAfter 18 years I just thought fuck you and left and I'm now at a lake rethinking everything. My parents said that everything that they did was for me all these 18 years and now im repaying them with this. \n\nI just don't know anymore.", "&#x200B;\n\n We were having a farewell dinner with my aunt and uncle because I'll be flying to the UK to start University. Because I don't have much time left in the country I brought up the issue of me getting a replacement phone. I'm not the type of guy who needs to have a new phone every year. I'm only asking to change my phone now because for the past 3 months I going from fully charged to 50% in 5 minutes. I brought this to my parent's attention 2.5 months ago so I wasn't exactly springing a trap on them. We discussed it a bit with my uncle and aunt but eventually they agreed to get it for me as an early birthday present and everything was good.\n\nThen my Dad started to bring up issues like how I need to study hard in school and not waste my life away. I'd be completely fine if it wasn't the 32nd time in the past week. To give you an idea of the kind of people they've been acting like recently: they reminded me that I had to go out shopping to buy winter clothes for the UK as I won't be used to the cold weather. Fair enough. This was 4 months ago btw. There was a discount going on at a local clothing store this month so naturally I didn't stock up right away. For 3 months straight at least once every 2 days they would come in and \"remind\" me to go stock up on winter clothes. It's more like a lecture on how i need to be responsible when I tell them that I'm waiting for a sale every time.\n\nAs you can probably guess, this dinner wasn't the first time they brought up the issue of me studying hard overseas. I'll admit, after hearing the same shit come out of my Dad's mouth for the 10000th time over the course of the last year I got a bit pissed off and told him to drop. Nothing vulgar and rude. Just a simple: \"That's enough. We've had this conversation before I'm sick of listening to the same thing over and over again when I can't do anything about it\". Cue him flying off the handle talking about how I don't appreciate the good life I'm living now etc.\n\nBut this isn't even the worse part. The worst part is that after he got mad in the restaurant he said \"you know what, you can forget about your new phone\". This is when I blew up. The reason i got so mad is because like everything else, this isn't the first time he's pulled some similar shit. It's always the classic \"I promised you something but now i'm going to create a situation where you're rude to me so I can now use this as an excuse to back out of my promise\". When I was 5 it was a deck of Pokemon cards that I really wanted. When I was 8 it was a Moleskin calendar notebook, at 13 it was a football jersey, at 14 it was a wallet and then later a pair of headphones, at 16 an eggbeater so that I could cook for whoever came to the house for dinner. There are probably many more that I can't remember. Well this time he got out of the chair to leave the dinner half way and tried to create a scene in front of my family. So I kind of lost my shit and called him a \"15 year old in an adult's body man child\". AITA?", "Ok I swear it’s not as bad as it seems. But here’s the story:\n\nFriday I asked a girl out, I had had feelings for her for awhile (over a year) and I mustered up the courage to tell her how I feel. Of course she rejected me and I thought that was that. This was Friday night. \n\nEdit: I get like this post needs some more backstory so basically I met this girl about two years ago at first we didn’t talk much but then we started talking a lot. We had actually become really close friends. About 10 or so months after we started talking I started to develop feeling for her this was all about a year ago. Anyway her friendship meant a lot to me because I don’t have a lot of friends. \n\nSaturday I don’t talk to her and she doesn’t talk to me. Today (Sunday) hits and one of my friends tells me that she thinks I’m ignoring her. I’m ngl I was ignoring everyone cause I was deep in my feelings, but anyway I called her and here is how the conversation went:\n\nMe-“Hey (friend) told me that you think I’m ignoring you. I wanted to say that I’m not but I’m sorry it came off that way.”\n\nHer-“Its fine, but why haven’t we talked at all?”\n\nM-“I just didn’t think we had anything to talk about”\n\nH-“Oh so u were just being nice to me this whole time to get in my pants?”\n\nAt this point what she said just got under my skin and I started talking more harshly. \n\nM-“Is that seriously what you think of me? I’m not like that and even if I was I can constitute that sort of reaction if we stopped talking for like a week, but no it’s been a day and a half so I think you need to chill out.”\n\nH-“Dude like I said I don’t like you in that way so don’t get mad at me for it.”\n\nM-“Ya I know that but I don’t remember you texting me either so don’t act like your above it all.” \n\n(She’s had history of acting like no one is perfect except her it’s rare that she acts this way but sometimes I wonder if deep down she believes it)\n\nIt kind of puttered out from there for a couple minutes then we stopped talking and haven’t talked since. This happened about 8 hours ago.\n\nEdit 2: I have got some remarks on the “I just didn’t think we had anything to talk about” line. I want to make it clear that I was not trying to stick it to her that I’m not talking to her nor was I trying to be an entitled nice guy. What I probably should’ve said is “I don’t really feel like talking rn” and that’s what I meant. But in the moment I just said the wrong thing.\n\nEdit 3: Tomorrow I will talk to her about everything things that I need to make clear and some issues on her end that u guys have brought up so thank u. I will try my best to post an update so be on the lookout for that.", "At my work our uniform is the company shirt and “black pants and shoes”. Work supplies the shirt and we supply the rest. My black pants of choice happen to be leggings and a few times I’ve now been called out for this by co-workers for being unprofessional or “trying to be sexy”. Apparently my skin tight active wear is distracting to our customers and offensive to some. I don’t really see the issue. I fee more comfortable in them and it’s not company policy to not wear them. AITA here?", "Some background info, I am a President for a hiking club/camping club for college. We do a lot of hiking trip/ camping activities but we also do a variety of stuff like laser tag, go to museums, and festivals too.(This is sort of relevant). Our club does these activities to make our club more inclusive to less active people\n\nA group of members of the club are arranging a camping trip, and we have only a limited amount of spots. We’re filled up except for one spot, a blind girl wants to go, and calls it first, but a guy who’s part of the group who’s planning the trip, wants me to give it to a non- handicapped person because the last hiking trip we essentially had to only hike on a flat paved trail instead of a more difficult trail so the 2 handicapped members can come with us. \n\nThe group who’s planning this are more hardcore hikers/campers and want to be able to hike anywhere in the state park without having to limit ourselves to a smooth path. I want to make the trip enjoyable to them but I’d feel like shit if I have to lie to the blind girl and take her spot away from her. \n\nThe guy pushing me to give her spot away, suggests I just come up with another activity to cater to her to make up for the fact she won’t come on our trip.  I’m not sure what to do. WIBTA if I hand her spot away to a member who is able to keep up with the group pace. \n\n\nUPDATE: We came to a compromise to just plan separate hikes for the camp trip, one for the people who want to hike of the difficult trails and the other to go to accessible trails.", "My (25F)parents have been divorced since I was 10 and my 2 younger brothers and I live with my mom. About 6 months ago my dad (42M), introduced my brothers and I to his new girlfriend who’s 31. She seemed nice and everything but I can’t get over the fact that she’s only 6 years older than me. \n\nFor Labor Day, my dad and his girlfriend invited my 2 brothers and I to a beach house they rented for the long weekend so we could all get to know each other better. I declined and told my brothers straight up that I felt it was weird that she was so young and that I didn’t want to get to know her any better. \n\nMy brothers and I have been arguing over it and decided to leave it up to Reddit to decide. Am I the Asshole?", "Last year, my BIL got married to the woman he has been dating for 10+ years. My husband's family is very close knit and they all talk to each other multiple times a day each day.\n\n&#x200B;\n\nWhen my BIL was planning his wedding, he did not include my husband in his wedding party. That surprised me since he has only one sibling and my assumption was your brother was in your wedding party, unless you didnt get along.\n\n&#x200B;\n\nSo, my husband raised that as a concern and my BIL begrudgingly included him in the wedding party. His wife was really upset with the change and worked with the photographer to crop my husband from all of the pictures of the ceremony.\n\n&#x200B;\n\nLast week, she tried to blame me for forcing her to change her wedding set up. \n\n&#x200B;\n\nAITA for thinking my husband belonged in that wedding party ?\n\nEdit: just to clarify, this is my husband and his brother.", "Apologies for format, on mobile. \nMy brother and his wife have a beautiful 4 year old son and I love him to death. He's a great kid. My brother and SIL are pretty alright parents for the most part, but they are slobs and there house is very dirty. I'm not talking just cluttered and messy. It's filthy. Dirty dishes piled up and left everywhere for months, garbage everywhere, rotting food, clothes on the floor, diapers left laying about, dog pee left on the floor until it dries there, etc. They don't sweep, vacuum or mop. They don't wipe counters or clean up spills. The bathroom is so nasty, they don't clean the toilet or nephews training potty. It is so unsanitary and gross that I can't even stand being in their house. Several times I have come over to clean their house and cleaned it completely. I'm a former maid for very rich people, so when I say cleaned I mean freaking spotless. Spent 18+ hours each time cleaning it. And the next time I come over it's a freaking mess again. I've talked to them several times about how unacceptable this is, I've written out basic cleaning schedules, lectured them on how they need to do better for their son. I've told them that they a negligent and that if they don't get their shit together they could lose their son. But I can't seem to get it through their thick skulls. They show no signs of changing. My nephew deserves a better life than this. I've given them so many chances, I just don't know what to do anymore. I'm seriously debating calling CFS on them. They'd probably get a warning and have someone come regularly check in on them to make sure they are taking care of nephew properly. Worst case, and probably equally likely, they'll take nephew away. He's likely be taken in by his grandma on SILs side, or his other grandma my mom. Either would provide a better life for him. But there's a chance he'd be taken away completely. I'd feel like an asshole ratting my brother and SIL out. He's not being abused, he's fed and healthy. But the unsanitary conditions he has to live in are not ok. WIBTA?", "Background: My (28F) fiancé’s (29M) dad has been a professor at an Ivy League university in our city for 30+ years. His position comes with benefits, including undergraduate tuition exemption for any kids under 26 and taxable tuition (explained below) for any kids in grad school.\r\n\r\n\r\nFiancé’s parents divorced when he was young. Dad refused to pay child support for years which caused a lot of bitterness between him and mom. Mom did not hide her hatred, fiancé grew up being told his dad didn’t care about him – he has depression and a bad relationship with his mom, but when he got older and dad quit drinking, relationship with dad got better despite their past. \r\n\r\n\r\nFiancé dropped out of college in ’09 after his first semester and that’s when we met and started dating. Next few years he went to community college near my college, we lived together (‘11-‘13) and his mom paid his rent, and after I graduated (‘13) and moved back home he moved with me and lived with me at my mom’s house rent-free (my mom is awesome and loves him like a son). We both worked for a few years (‘14-‘17) and in that time he decided he wanted to apply to finish his degree at his dad’s school. He got in and bc he was still 26, paid no tuition for the next 2-3 years and finished his degree this past May. He got into a master’s program (with a small scholarship) at the same school but now has to pay some tuition.\r\n\r\n\r\nEach year he has taken out a small loan ($8-10K) to help with living expenses, books etc. I am not working anymore (back in school) but with savings from my job and a substantial inheritance from my father, I keep us comfortable, pay rent and most bills, which I am fine with. However, I cannot afford to help my fiancé with tuition (nor would I be allowed to since my inheritance is in a trust and heavily regulated).\r\n\r\n\r\nTaxable tuition 101: the tuition that would normally be paid is added onto the professor’s income. If dad makes $100K/year and tuition is $20K, his income is considered $120K and he is taxed based on that amount. So if income tax is 30% of annual income, he pays $36K in taxes instead of $30K. This results in a loss of $6K for that year (none of these numbers are exact but also not too far off from the real numbers).\r\n\r\n\r\nDad does not want to lose this income and wants fiancé to pay him back. My feeling is that he never paid child support, tuition, or living expenses for his son growing up (despite having the means), and this is a small price to pay for his neglect. Fiancé told dad he can’t afford to pay him back so dad said fine, he’ll pay, and his girlfriend even offered to pay half. Recently they spoke again and dad reneged, he still wants money from fiancé for tuition. This money would come out of the loan money he receives for living expenses which he already has to pay back. We think dad is being selfish and unreasonable. What do you think?\n\nEdit: Thanks for all your responses. In retrospect a more accurate query would have been “AITA for suggesting/feeling like it would be the right thing for my fiancé’s dad to not make my fiancé pay him back for income lost due to taxable tuition?”, mainly because some of the finer points were missed and my actual part in his conversation with his dad was misinterpreted due to my poor phrasing (I was not part of their conversation at all and merely offered my fiancé my opinion), but I accept your judgment regardless and thank all of you for your time and thoughts.", "My brother was telling me about his chronically unemployed wife's new job as a medical assistant. He described all these things she did on her first day, like taking vitals from patients, using an ultrasound machine, hooking up and IV, seeing a patient's genitals and some other stuff that seemed way beyond her skill level and training something a person should not be doing on her first day and it set off alarm bells for me.\n\nI've been in a lot of medical facilities lately since I'm pregnant and about to pop and I like to chat up the people I interact with. I know a lot of the things my brother described involve certifications or multi year programs that my SIL has not done. So I expressed shock that the hospital would put an untrained person in such a patient forward position on her first day. I said I was uncomfortable with the idea of going to the hospital now if it was possible a person doing all this stuff for me was untrained like her. I also told him that going from never working more than part time to doing 12 hour shifts is very hard and instense. My husband said my tone of voice was super mean when I said this. \n\nI realized later that she and my brother were probably just overblowing her having a tour of the facilities. So by being shocked at this story not jibing with my experience with medical industry my husband said it came across like I was implying she was incompetent and a liar. My SIL wasn't present it was just my brother, parents and husband around when we had this exchange. Thinking back I could have been more tactful in how I said these things and I felt the need to set it straight.", "[removed]", "So I have 4 siblings, I was supposed to go to New Jersey for a tournament Saturday and instead I stayed home so I can watch my brother, I never watch the kids so I was not expecting any money, no big deal, so I just ask my mom to give me a ride into town so I can compete Ina. Tournament, she tells me ok,I'm watching my brother from 1-8, my mom comes home, gets stressed and goes to Wawa. No big deal so I'm watching the kids for another 2 hours. Mom comes home I go to bed, wake up I'm getting ready to go, my dad tells me I'm not going because I should not expect anything for watching the kids. I was pissed off and stormed to my room. I told them if I knew they were gonna back out on me last second I wasn't gonna watch the kids. AITA here? Oh yeah and it turned from watching my brother to watching my sister and her friend that was sleeping over.\n\nEdit: my age 20m", "Our young son just got his first vaccine shots the other day, and he is running a very low fever, which the doctor warned us could happen.\n\nMy wife was telling me that the fever was her fault, that not breastfeeding could have resulted in him having a weaker immune system leading to the fever. I knew breast feeding was a sore subject for her, so I thought I'd reassure her and tell her \"I don't think it is your fault\". She asked me what I meant by \"don't think so\" and I told her that \"I'm not a doctor, but I don't see how it could be your fault\". I wasn't sarcastic or hesitant like \"I don't *thiiiiink* so\" or anything, I meant it and I was really trying to reassure her.\n\nShe blew up at me. She said that there was no way it could be her fault, and I should have said so. I pointed out that she was the one who even brought up that she could be at fault, and she responded that she didn't mean it, she wanted me to reassure her it wasn't. I got angry because thats what I *was* trying to do, but I felt like I lost secret forbidden word bingo, and she was twisting my words to produce the worst interpretation possible... and since I'm on here, I'm sure you know how it went after that.  \n\n\nAITA here?", "This is a recurring issue for me with dating, and I'm really not sure if it's a \"wow, what an entitled little brat\" thing or a \"perfectly reasonable\" thing.\n\nI have ULTRA sensitive skin, and if I'm passionately making out with a guy with stubble, the rubbing of the coarse stubble against my mouth and chin *always* gives me painful beard burn. After about five minutes or so it becomes so painful I'd prefer to stop, but of course push through it because I'm a grownup. Then the rest of the night my face is red and painful, and the next day the skin around my lips and on my chin cracks and flakes off very noticeably. It's embarrassing AND painful. \n\nBeards are great because they're grown out and soft, and clean shaven is great too. It's just stubble that gives me this issue. The guy I'm seeing now is amazing and very passionate, but I always have to sleep with medicated ointment on my face after seeing him; super un-sexy now that we regularly spend the night together. He shaves in the morning, but by nighttime he has painfully course stubble.\n\nWould it be a total asshole move for me to ask him to shave before we're gettin down and dirty? I'd really just love to enjoy it as much as possible, but, conversely, if a man said to me \"you have to shave or wax immediately before hooking up with me, any stubble is unacceptable\", I would find that a little off-putting, because I see it as being \"enough\" to shave morning of (though he wouldn't be repeatedly putting his face on my legs, and my bikini area is always waxed and very smooth). \n\nIs this an asshole move? When girlfriends and I talk about this they're always like \"why would you put up with that, have some spine\", but I'd really hate to offend a guy or make him feel like I'm high maintenance and need something special and ridiculous that other women don't. WIBTA here?", "[deleted]", "Background:\n\nI get it, \"loving-but-transphobic\" looks like an oxymoron, but any trans person who has been through this knows what I'm talking about. My parents support me in pretty much every way--they paid my way through college and help me financially in graduate school, they've pushed me to do my best in my field, they always have a place for me at home, they check in on me every week, and help me navigate tough situations. They're pretty damn great...for the most part.\n\nThe problem is, the fact that I'm trans is a sticking point. It is the one thing that has *ever* caused a conflict in this family. I've been out to them for over a year and it's been rough. I've spent that year being deadnamed and misgendered with no attempts to correct themselves or even apologize. Mom admitted to wanting to steal and throw out my chest binders. And it all culminated with my father desperately trying to convince me not to start hormone therapy, him even trotting out talking points such as it \"destroying my body\" and \"being the easy way out.\" I've tried to reach out to them with books, essays, in-depth and even demeaning discussions of my dysphoria, \\*everything--\\*but progress is minimal and barely worth the stress it causes.\n\nSituation:\n\nI'm 21, and navigating gender transition on my own is what taught me to be independent--navigating the legal system for my name change, confronting transphobic doctors and professors, building my own support network, etc.--and this is culminating with a road trip (this weekend!!) to a clinic where I will FINALLY get hormones and pay for them out of pocket. I have been planning this trip since August and I have not told my parents about it. I know they will find out eventually, and I will have to deal with the fallout when they do--including being ready to be seen as the asshole. But it all comes down to refusing to let their transphobia lessen a moment I have been waiting years for. Besides, I'm an adult--I can do whatever the fuck I want, right?\n\nHowever, while discussing my road trip with an acquaintance, she said she would be heartbroken if one of her children suddenly started hormone therapy without telling her. She loves her children, and I know for a fact my parents still love me, even if they don't quote-unquote *support* or *accept* me. After discussing this for a while, I started to wonder if I had made the wrong choice in not telling them. I hadn't even considered their side of the situation, or even if I should consider their side at all. Would I be damaging their trust in me? Is this *wrong* of me? Her comment started to eat at me, and now I can't stop thinking about it.\n\nSo.\n\nWIBTA if I continued to stay quiet?", "My wife owns and sells alot of funko pop figures, she has a shelf in the dining room where she has alot of her pops that she is selling to others. I have told her on many occasions to put all of those pops in the basement bc 1) we have a 2 year old that is a true juggernaut and destroys everything and 2) I dont want funkos in our dining room bc I want it to look nice. Either way the house is both of ours, and if she wants to keep them there... go ahead. Today, while my wife was packing for her trip, I spent the entire day with our 2 year old playing outside, and all around the house. After we were done, I noticed how messy the house was, so I decided to clean up while he played with his cars. After a few minutes of cleaning up, I could hear a box crunching in the dining room, I knew immediately he had gotten into the funko figures. I ran in, and he was crunching one of the boxes of a funko my wife had just sold. I told my wife immediately and she was furious at me for not keeping him in the gated living room where he couldnt escape. AITA?\n\nEdit: the main floor is completely baby proofed, with doors going to laundry room, bathroom and front door locked. I literally cleaned for about a minute, so I wasnt expecting the mayhem immediately. Thanks for feedback btw", "My MIL is in town for a 3 week visit. She will not contribute to the running of the house, if even to pack her own load. \n\nI was out for a company dinner and got home while my family and MIL were eating supper that my wife planned, bought, cooked and served.  Once done, MIL bussed her dishes, then went and sat on the couch. I am now doing (paused to write this, wife now doing it) the dishes for a meal I didn't eat, so that work load isn't also left on wife. \n\nAITA to ask my partner to talk her mom about her freeloading? \n\n(Once I hit POST I am getting back at the dishes)\n\nUpdate: Got the dishes done. Had a review of your input. Thanks for the varied insight, I shared the post and comments with my wife, then we had a lengthy discussion, which led to a lengthy but pleasant and productive discussion with MIL.  Turns out ESH, but hopefully the conversation leads to NAH. Thank you to everyone.", "[deleted]", "So I really don’t like the idea of my girlfriend posting nude pictures of herself on the internet. She posts on sites like reddit and 4chan, she hides her face but I managed to identify her from her body and her surroundings, I  just learned about this recently, she was doing it behind my back. It's really not ok to me and I do consider it to be cheating. We’ve been dating for 9 months, we’re both 20 and everything was fine up until this point. \n\nI was pretty mad at her and said I felt like she was cheating on me. She said that I'm being a hypocrite and unfair because I watch porn and look at nudes of girls on the internet myself so I should be ok with it. But I don't understand how does it even makes sense and I'm thinking of breaking up with her.\n\nam I the asshole and a hypocrite here? can someone explain to me?", "I (26M) am insisting my GF (27F) get a flu shot. For starters, she works with kids and frankly I’m surprised she’s not required to get one as part of her job. Second, my mom is on an immunosuppressant that makes here more susceptible to getting contagious illnesses like the flu. My girlfriend spends a significant amount of time with my family, especially my mom.\n\nMy GF is opposed to getting one because the two times in the past she’s gotten a flu shot (I have trouble believing she’s only had a flu shot twice) she’s wound up getting the flu later that flu season. She’s convinced the flu shot caused her to get the flu both of those times.\n\nI have explained to her that flu shots use a dead version of the virus, and that the dead virus can’t cause the flu.\n\nI have also explained flu shots are not always perfect. There are different strands and pharmaceutical companies are giving it their best guess as to which strain will be prevalent in a given year. So if you got the flu after getting the vaccine, it’s because they wound up getting the prediction wrong.\n\nShe doesn’t believe me and is rather insistent that the vaccine caused the flu, and therefore she not get the vaccine. I’ve told her to ask a doctor friend of hers and she refuses. So we’re at an impasse. AITA for not budging.\n\nAlso, she gets vitamin shots so it’s not like she has a fear of needles.", "[deleted]", "[deleted]", "Throwaway really only because I saw this sub open on a classmate’s computer (hi simon). \n\n\nSo I’ve just started a new education it’s been great so far, I live in Denmark but the school is very internationally oriented. I originally applied for the English line but ended up on the Danish line which is obviously nbd for me. \n\n\nWe have the same books and teachers as the international class, including an American teacher who has lived in the country for 20 years. He tries to teach us in Danish, which he’s spent a lot of time learning and is relatively good at just.. not quite enough. \n\n\nIt makes the lesson very hard to follow sometimes, even after getting used to some of his common mistakes each lesson brings a new head scratcher. It’s mostly when he gives us tasks it really causes mass confusion, because he’ll say stuff like “line-up” when he means “sit across from each other” and so on. \n\nEvery exercise loses 5 minutes to people trying to decode his intent or waving him over to explain again. Some groups also end up just doing a completely wrong task because they thought they got his point the first time around.\n\n\nSometimes he slips up and starts speaking English because the class is very tech based and tech is mostly in English here, and we pray for those moments to never end because we can finally understand him clearly. \n\n\nAs a trilingual I get the need to practice and use your new languages as much as possible, that’s also why I feel like a huge douche for even thinking about bringing it up. I know a huge chunk of my classmates feels the same, but also that it would be rude and discouraging to ask him to switch back to English. \n\nWe’re also aware that us Danes have a bad habit of speaking English to learners to be polite and make the short-term conversation easier for them, when it actually disheartening to many and makes learning the language long-term even harder for them.  \n\n\nHe’s obviously worked hard to even get to the level he is at now, he understands us perfectly when we speak. \nWe’re all stuck in a pickle of misplaced politeness, and we don’t know what to do or how to do it... just like in class.\n\n\n\nTLDR: American expat teacher cannot into Danish, we kind of just want him to go back to speaking Common.", "I think I am in the clear, but I wanted a gut check My amazing partner (early 30s MF) bough me a lovely, sapphire heart shaped necklace for my 30th birthday. Think a .8karat heart of the ocean from Titanic. I love that he spent time picking something for me. However, he mentioned either picking something else or letting me give him some guidance if it's not my taste (his idea not mine). It kind of isn't my taste because of the shape, and I have something basically the same this am oval shape (that I wear a lot). However, I never would have said that if he hadn't said something first. I think he wants to know I would like it because it was $1,000 plus.\n\nSo here is the question. I am a 30 year old trial attorney. I haven't worn heart shaped jewelry in at least 15 years. It feels to me like a nice version of what my HS boyfriend bought me. First question is: Is heart shaped jewelry seen as juvenile, especially for a professional? Second question is: WIBTA if I either gave him some guidance to let him try again or went with him to pick something else?\n\nFor reference, this is the piece: [https://www.shaneco.com/necklaces/heart-necklaces/heart-shaped-sapphire-and-round-diamond-pendant-18-in/p/41044061](https://www.shaneco.com/necklaces/heart-necklaces/heart-shaped-sapphire-and-round-diamond-pendant-18-in/p/41044061)", "It was about 20 min before Chipotle closed. As I was walking to the door, a women carrying a kid came, and I opened the door and let her in front of me. No big deal. Stores about to close, we've been in line about 10 min, and I'm the last one in line. When we get to the front, her other family members arrive and sit down. This girl proceeds to order 8 burrito bowels. I'm super annoyed because it took forever, but then I get to the front, and they're out of everything.i was pissed, she knew she was doing a huge order and still got in front of one person with one order. As I'm leaving I get their attention, and call them something along the lines of, \"3 generations of trash\". AITA?\n\nEdit: okay, I get it. it was an @$$hole thing for me to say. At this point, I'm wondering if it is more YTA or ESH\n\n\nOkay, I get it reddit. It's my fault for being polite. How dare I think about someone other than myself. Just what we need in this world, less polite people.", "So I (21F) have a friend (21M) and the plan was to get dinner and catch a movie after. Halfway through our meal, I received a call that my younger Brother got into an accident. Thankfully, he got away with only a dislocation, but he’s currently hospitalised. \n\nI wanted to be there for him so I told my friend that I wouldn’t be able to go for the movie. He got visibly disappointed and said that it was my choice, but also added that it was just a dislocation and that “his family weren’t there either when he dislocated his shoulder”. When I told him that I didn’t want my younger Brother to feel bitter that I wasn’t there for him, he told me that this one incident wouldn’t affect things. \n\nAfter probing, he told me that he was disappointed as we hadn’t met for a while and we finally managed to schedule this. \n\nI honestly don’t feel like I’m at fault, but I don’t know if I’m just being short sighted, and maybe it’s not right to cancel?", "I have a two year-old blue heeler, a breed needing lots of exercise. \n\nI live in a residential area. All the properties are fenced. To get here, there is no other access than an highway exit, in or out. To resume : South : river, West : sea, North : sea and East : highway. \n\nI live in a tropical country, where dog parks aren't a thing here, there is not a single one of them even in the city.\n\nI have a 7:30am to 6:00pm job, Monday to Friday. Commute is  30min. Dog is left free to roam in my property and has plenty of cover, water and enrichment. I worked on training her so she doesn't bark. She doesn't bark at the mail man, she doesn't bark when people are walking on the street. She doesn't bark when the neighbors dogs are barking too. I'm really proud of her.\n\nLots of people here have dogs, if I were to estimate about 90% if not more (burglary is quite common). \n\nOnto the interesting part : I walk my dog every day at 6:30am for 30 min then again at 7:30pm for 30 min, after I ate dinner. \n\nVet said routines are good for her since she has high energy and I should try to keep it as regular as possible.(MD said I need to exercise too ahah).\n\nThis week, I had two incidents unrelated incident during these walks. During both she was leashed and I was wearing my headphones but just over one ear, so I can still hear around me in case of danger.\n\nIncident #1 : Saturday morning 7:10am, we left about 30min late because it's the weekend. On the way, lots of dogs bark at us. Few people say hello then at one house a lady goes out upset and yell at her dogs and at her neighbor's dogs to shut up. After a few seconds she notice me\n\nHer : REALLY NOW?! \nMe : What? \nHer : You know people are sleeping, damn! \nMe : Well, I work the rest of the time.\nHer : It's the weekend for God's sake! Other people work during the week too! [Yelling while throwing hands]\nMe : It's not my dog barking, it's yours. I'm walking on a public road for what I recall and I made the effort to go on the opposite sidewalk. Maybe if you trained your dogs... \n\nShe huffed and puffed then got inside her house while I went away. \n\nSunday I went walking alone to see if it was really my dog who caused the rukus. Well... ALL the dogs still barked at me. I have to say not a lot of people walk in the street around here. \n\n\nAccident #2 \n\nTonight, 7:45pm. Half of the dogs don't bark then a Rottweiler barks like Hell broke loose. A lady, in her bathrobe goes out, yell at her dogs then notice me. (I guess you see where this is going) \n\nHer :  WHY WOULD YOU WALK YOUR DOG AT THIS HOUR! FUCKING MORON! \n\nI didn't say anything just continued walking.\n\nSo I'm wondering if I'm in the wrong because while I don't think my hours are that horribles (not before 6am or after 9pm), I upsetted two of my neighbors, so maybe I am in the wrong...\n\nSo Reddit, AITA?", "&#x200B;\n\nI am one in a set of triplets (all f, 25). One of my sisters, Kathy, is a nonverbally autistic, and she requires around-the-clock care. Currently, she lives with our other sister, Karen, but that will not be an option for much longer as Karen's husband is taking a job overseas. \n\n&#x200B;\n\nI teach at an all-girls boarding school, so she would have to live in my rooms there. However, I would also have to hire care for her during the day, as well as make arrangements for the providers to enter the school daily, which the Headmistress is not free in allowing. \n\n&#x200B;\n\nKaren and I would like to put her in a nursing home for her care, but our parents were adamant in not wanting that to happen. They would be very disappointed in us.\n\n&#x200B;\n\nWould I be the asshole if I didn't let her move in with me?", "During a drunken night, my boyfriend (26) told myself (25), my mom and my sister about a student loan that he will have to start paying on in October. He said his mom just told him about it a few days ago. It’s a parent plus loan. The amount he’d have to pay a month was ridiculous. The next morning we got breakfast and he told me the loan is upwards of 150k. Apparently it’s a consolidated loan between him and his two siblings. He went to a state college for 5 semesters and he said his debt is about 35k. His mother wants him and his siblings to split the loan into thirds which is how she calculated the amount per month they would pay. However, according to her calculations he would be paying 20k extra in loans that aren’t even his. I implored him to speak with her as this could really cripple us financially. Yesterday he talked to her and she pretty much said that it is what it is. She claims there is no way to see how much he owes because the loan is consolidated— which I know is untrue. I told him he needs to figure it out. I also told him that she is essentially stealing from him. He got really upset. I continued to tell him that, “if that bitch ruins our chances of a stable financial future I will tell her how I feel myself”. He told me I cannot talk about his mother that way and that I was being selfish. We have been distant since the conversation, something that is not normal for us. \n\nSo Reddit, AITA?\n\nEDIT: We have been dating for four years, been living together for three. His mom constantly asks when we are going to get married and give her grandchildren. Thought this would maybe give some better insight to how serious we are.", "I hope you guys can help me because I don’t know what to do. \n\n*Possibly important info*: This is taking place in drama school, the age group of my class is between 18 and 23. We’re seven people in my class in total, the person in question is the only guy. He’s also the youngest. \n\n**Anyways**, we’ve been in the same class for about three weeks now, which I’m aware is a short amount of time. \n\nHowever, within that time C managed to be disliked by everyone. Nobody wants to work with him or hang out with him during breaks. \n\nThe main reason for this is that C can be very condescending, arrogant and overall unpleasant. \n\nHere are some examples:\n\n• J offered him some radish and his response was just “Do I LOOK like I want radish?” in an annoyed tone\n\n• J told him that his hat looked nice, he just responded with a cold “I know”\n\n• He never listens to anything or anyone, and expects people to repeat things for him (which is fine if it happens a few times, but it happens every time and is starting to feel deliberate)\n\n• He does weird things for attention, like putting a pen under his hat and staring at people with a smug grin\n\n• He’s never prepared for class and has been told off by professors, but he still feels like he performs the best (which is objectively just not true)\n\nThe list goes on and on. It’s getting noticeable that nobody likes him - which I think is a shame. Obviously he’s responsible for his own behavior, but at the same time it feels like he’s painfully oblivious to how he comes across. \n\nWIBTA if I talked to him in private and told him how his behavior affects others? Or should I stay out of it?", "Throwaway because my cat might read this.\n\nIn all seriousness, my cat was an outdoor cat when I lived with my parents. So, basically her entire life. She is six years old. My parents live in a cul-de-sac and I felt like the neighborhood was relatively safe. My cat is extremely smart and I trust her with taking care of herself out there.\n\nI recently moved out of my parents house into apartments out in the mountains. There are more wild animals out here and I don’t really trust people to let her roam free especially since she’s such a friendly cat. She only lets people she trusts pick her up but if a stranger becomes someone she trust, they can easily take her away. The neighbors at my parents house knew it was our cat. \n\nNow, am I the asshole because I keep my cat indoors? She’s getting old and I don’t think she’ll be able to fend for herself forever. She is becoming more talkative and extremely impatient and I can just tell she’s angry at me for not letting her out. She’s miserable. AITA because I won’t let her out? She’s capable, but it’s a new area and I’m scared to let her run free. I just want to protect her and keep her safe.", "Little back story - I work as a delivery driver for a pizza place. I am honestly not paid enough for some of the shit I have to deal with, and how people speak to me. Most of the time, I bite my tongue. The whole 'smile and wave boys, smile and wave' thing is something I try to live by. Remember folks, the customer is always right *insert eye-roll*\n\nHowever tonight I had a Karen.\nWe get several deliveries to houses that are down long drives, with multiple addresses. It's honestly confusing as shit at times, especially when they don't put numbers up on fences or whatever. This is what happened tonight.\nI got pretty lost. Called the customer. She sounded pretty annoyed that I was calling even though the delivery note said 'call if you get lost'.\n\nI arrive with a smile on my face. She's at the door waiting. Ask her how her night is. The usual.\nI get a \"is this your first week on the job?\"\n\"No maam, I've been here for about two years now\"\n\n\"Well don't you delivery drivers know how to use Google maps? I'm not impressed that you had to call me. Can't you do your job? \"\n\n\"Excuse me?\"\n\n\"You heard me. Don't you know how to use Google Maps. It's not hard\"\n\nWell for a start, Google Maps wouldn't have helped me in this situation. It doesn't show the exact location, especially if it's multiple houses down a drive.\n\nI snapped.\n\"Maybe if you'd put some fucking directions on your delivery note, then I wouldn't have this problem. It's pitch black, there's no numbers on the fence. What am I supposed to do?\" \n\nShe looked pretty shocked, then the inner Karen came right out.\n\" I don't appreciate your tone at all. There is no need to speak to me so rudely. Maybe you should re-learn some customer services skills and some  manners. I'll be making a complaint to your boss. What's your name?\"\n\nMe feeling pretty petty and over it by this point told her that I didn't have to give her my name if I didn't want to, which I don't.\nShe huffed in my face, took the pizza out of my hands, and slammed the door in my face.\n\nHere's the thing. Don't have a note saying 'call if you get lost' if your just going to belittle someone. I'm more than happy to give the pizza to the wrong person if that's what you'd like.\n\nSo, AITA for snapping?\n\nTL;DR: Karen got pissy because I asked for proper directions to drop her damn food off to her so I got pissy back.\n\nEdit - to those saying 'I'm in the wrong job' and 'resentful of my customers'. I love my job. I like meeting the people I meet. I've made some great friends out of regular customers. But every single person is allowed to have those days where they get frustrated at the way they get spoken to or treated. I'm a pretty chill person, it takes a lot to get me pissed off to the point of snapping back. \nWas I unprofessional. Yes.\nAm I proud of how I acted. No. \nDid I regret it after. Yes. \n\nMy boss is very understanding and even if she did complain, there would be no repercussions on my end other than 'don't do it again'. As my boss knows how some customers treat all the drivers there. So no, I don't resent my customers.", "I work for a natural history museum that holds a series of scientific lecturers for the public. There is a fee to attend. These lectures feature high-profile researchers and authors. Our auditorium holds about 300 people.\nWith a crowd that size, one expects the usual coughing, sneezing, and other unavoidable human noises. And the occasional a-hole who doesn't know how to silence their cell phone notification sounds.\nOne of the regular attendees of these lectures brings a dude ( looks to be in his mid-twenties) who is severely disabled, both physically and mentally, solidly strapped into his wheelchair. When they first started coming, he would grunt and hoot and make all kinds of distracting noises through the whole lecture. People sitting near them looked visibly annoyed, but also sympathetic toward a disabled person.\nRecently, this same family started bringing an iPad and playing a movie for the guy in the wheelchair. With the sound on. Without earbuds. People sitting near them now get to hear all the sound from the movie along with the lecturer. When a co-worker finally asked them to turn it off, the family responded, \"Oh, he'll stay much more quiet if he can watch a movie while we're here.\"\nWTF? If this human is so disconnected from reality that they cannot hear or understand the lecture, why are you bringing them? I feel like this is the same if a family brought a crying baby. I would politely ask them to take their crying baby out of the lecture hall until they could get it quiet. \nAITA for being annoyed with this family? I am not taking away from the heartbreak of having a severely disabled loved one.  I am judging them for imposing that disabled person's inability to stay quiet on others.", "My girlfriend, Alison, and I have been together for 3 years.  We've had some problems, we broke up about 4 months ago and have been back together for about a month.  There are some trust issues but I like to think we've done a lot to work through things.\n\n&#x200B;\n\nSeveral months ago (before we broke up) I went on a trip with my friend Jake who is part of a 70 person friend group that plans group trips frequently.  Alison and I were invited but she was unable to go due to work (she has sundays but not saturdays off).  About 25 people were on this particular trip to some cabins in the forest.  Jake had a couple of female friends that wanted to try shrooms, so I sold them some and kinda acted as a guide for them on their mushroom journey.  I had a great time on the trip and Alison was bummed she couldn't go but was happy to hear I had a great time.\n\n&#x200B;\n\nWell this weekend Jake invited me on a camping trip with him and the same three chicks from the last trip.  Well Alison is not cool with it now.  She of course is unable to go again and says she feels uncomfortable about me being in an environment of 2 guys and 3 girls, especially since she has not met the girls (she knows Jake).   I've told her I have no interest in them and it's not like we'll be sharing a tent.\n\n&#x200B;\n\nI think that's kind of controlling and apparently I'm not \"allowed\" to make female friends? I know it would bother her but that's her own insecurity.\n\n&#x200B;\n\nWIBTA if I went even though I know it would bother her?\n\n&#x200B;\n\nEDIT\\*\\* The trust issues admittedly were because at one point I was not honest with her about talking to my ex and at another point I accidently emotionally cheated on her with a new friend who I just thought I was having a good platonic connection with someone because we weren't having sex.  \n\n&#x200B;\n\nEDIT2\\*\\*\\* At one point I met a woman and we started hanging out quite regularly. Every couple of days. She had recently gotten out of a bad relationship and we connected over that as my relationship with my ex was very painful. She started texting me pretty much every day and my gf did not like it. She claims that's emotional cheating because I was talking to this woman about things I didn't feel comfortable talking to my gf about, apparently I'm not allowed to talk to a friend every day, and this woman did not like my gf after they met once and so we decided it would be best if we hung out without my gf tagging along. In no way was I trying to get with her, I still struggle to see how that's cheating", "[removed]", "This happened about a few nights ago.\n\nMy friend (who I don't personally consider a close friend, but they're a good friend nonetheless) confessed that they fell in love with me, which really took me by surprise. They had already told me 2-3 months ago that they had a little crush on me but that it had faded away, and since then they've also had crushes on several different people.\n\nI'm the type of person that is rarely ever affectionate be it in actions/words/feelings, even to my closer circle of friends with the exception of 1 or 2 people. And most types of affection from people, that isn't my girlfriend, make me uncomfortable. My friends know this and respect it.\n\nSo the sudden confession made me feel really weird and out of place, like I froze up and didn't know what to do or say. I just went , \"Oh.\" And there was a kind of pause before I proceeded to say \"Of course I don't feel the same\" in a joking way (this friend knows I was already dating someone). I tried assuring them we could still be friends if they wanted and that this doesn't have to affect our relationship in any way.\n\nThey started tearing up and I *tried* to comfort them by, well, patting them on the shoulder. They asked me if I could hug them for a while, and I froze up again. I turned them down politely, but I feel I made them even more upset. They shortly just left after that, and I haven't talked to or seen them since. \n\nI described the encounter to my girlfriend/friends and they called me cold. I know the friend who confessed in this situation wasn't the A-hole at all, I'm just wondering if I was? Should I have been more warm (is that the right word lol) to them?", "tl;dr I had a life threatening health condition for four years. My sister ignored me during this period saying I was obsessed about it and she didn't have time to help because she has kids. Now I'm cured I don't want her in my life and it's hurting my mum to see her kids estranged. \n\n\n\nI recently went through a life threatening medical condition which lasted 4 years. It's a new one and the doctors didn't know how to treat it. I was alone in choosing my treatment options which had serious risks and was forced to make life or death choices alone. \n\nMy sister is a lot smarter than me and constantly promised to look into it to help me decide what to do but every time I spoke to her she hadn't looked into it and didn't want to talk about it because she felt I was obsessing over it. I spent about 9 months in a burn ward from it, had multiple instances of blood poisoning and ended up with all viral infection of my brain. She visited me once, as she was going to a restaurant near by and popped in.\n\nShe has kids and said she didn't have time because of them (she works part time as a primary school teacher) and was upset with me because I didn't engage with her and her life and family during this time because I was obsessing over my health.\n\nNow I'm cured I don't want anything to do with her. She's not a bad person as such, just in my view she's very selfish and won't take time to help anyone (me or my mum who was caring for me) if it was inconvenient. That's not the kind of person I want in my life.\n\nNow I'm hurting my mum by saying I don't want to see her, and hurting my young nephews because I don't come over to play with them anymore as I can't stand seeing my sister or her husband.\n\nAm I being an arseholes for choosing not to have her in my life, given it hurts my mum to see her two children estranged and depriving my nephews of their uncle?\n\nFor reference the condition I had was called Red Skin Syndrome, or Topical Steroid Withdrawal.", " This is lighter fare than a lot of what gets posted here, but I'm honestly still thrown for a loop and I'd love some third-party input.\n\nMy wife and I had a pretty middle-of-the-road wedding in terms of costs; it was definitely nice, but not a blowout or anything. My parents covered almost everything, as was their plan from the start. During the RSVP/invite window, my mom jokingly gave me shit for not putting up a registry yet-- we had honestly forgotten about it, because we weren't really in need of any gifts and didn't expect anyone to do so. She said people would probably feel awkward if they didn't get us *anything,* especially since she and my dad were covering every cost (including lodging), so my wife and I sat down to discuss it. We agreed we'd make an Amazon wishlist for some household stuff that we didn't have and kind of wanted, but that didn't end up amounting to much-- but what we *did* actually want was a little more wiggle room on our honeymoon. I want to be clear here: the trip was paid for already, from our own money, but it was that we had cut a lot of corners to fit it into our budget that gave us the idea for the fund. It made enough sense to us; instead of giving us things we don't need, if you feel compelled, you can donate a comparable dollar amount to this account that will be spent on padding out our dream trip as a couple.\n\nWe went through with it and added the option to our RSVP/general wedding info site. Again, to be clear here: there was *no* expectation of gifts in the first place, monetary or otherwise, which we even said on the site. Simply that if someone did feel the need to give us a gift, and nothing on the wishlist sounded good, this was another thing they could do.\n\nThe wedding came and went and it was genuinely beautiful, everyone had a wonderful time and I couldn't have asked for things to go any better. No one had said anything about the fund or the registry at all; a few things had been purchased from the wishlist and a few donations had been made (all of which we were deeply grateful for and were prepared to write the *shit* out of some thank you cards), but it wasn't a topic of conversation.\n\nA few days later, though, we were shooting the shit with some extended family that had stayed on, and one of my aunts kind of blew up over the honeymoon fund. Ranting about how \"incredibly tacky\" it was and how embarrassed we should feel over even having it there, much less expecting anyone to donate. We were kind of blindsided already, and then a few cousins agreed that it was weird and kind of snobby of us, and that we should have just been \"normal\" and stuck to a physical registry even if we didn't need or want that stuff.\n\nThis isn't tearing our family apart and it's not that big a deal, but I'm really struggling to wrap my brain around it. Was I really the asshole for giving an option to pay into a fund to pad out our honeymoon, despite being fully clear that no one was required or even expected to donate?", "Long story short, my 7 y/o Niece has her Birthday in January and usually doesn't have a party because its school holidays and its hard to contact parents and children for invites.\n\nTo make this \"fair\" on her she is having a party for Halloween and is classifying it as a Halloween / Birthday Party.\n\nwhen she asked me if it was \"weird\" i said that in my opinion it is, i said i was fine to have a Halloween party but once you classify it as a birthday party you're really just asking for presents.\n\nI have a fairly good relationship with my niece and we are upfront about things which is why i didn't second guess my response when she asked. \n\nAITA for sharing my opinion on this?\n\nEdit: thanks for the feedback everyone, especially those if you who shared similar experiences about birthday parties hosted when convenient. Honestly that was an alien concept to me and I wasent aware it happened and is well received. Those that agreed with my saying it was wierd; I appreciate your feedback too as no doubt the parents of the attending children will have opinions from both sides. So we are going to attach a little disclaimer note to all the invitations to clear up and misconceptions or confusions from other kids parents! I appreciate all responses on this post :)", "The title sounds terribly insecure. But hear me out a second.\n\nWe went to the beach today and it was a big deal for me. I have suffered and continue to suffer from confidence and self-esteem issues; today I made the big decision to wear a bikini for the first time ever. My SO is partly to thank; he stood by me and always encourages me to be happy in my own skin.\n\n It was daunting at first, but eventually I focused less on the feeling of being judged, and gradually felt more comfortable. After sunbathing we went into the water. We were having fun, joking about, playing together etc.\n\n I was standing, facing him, who was sitting in the water while he was facing the beach. I noticed him looking at the beach with interest but thought nothing of it until he said “she moved closer to our stuff because the water touched her feet”. My SO is French and although amazing at English, is not fluent- that’s why I was confused as to what he meant at first. I looked over my shoulder and saw that he was looking at a girl who was moving her things because the tide had come in.\n\n Thinking nothing of it, I nodded and continued enjoying my time in the water but couldn’t help noticing that he continued to look at her. I said nothing until he mentioned the same girl again which then made me look over my shoulder and saw her now standing at the waters edge.\n\n I appreciate beautiful people, and she was definitely one- with a great body at that. But on the other hand, seeing my SO taken by a stranger was starting to make me feel inadequate and slowly become conscious of my body again.\n\n I stayed silent, not wanting my insecurity to get a hold of me but at this point he wasn’t even looking- but blatantly staring. I splashed him and said with a laugh to quit staring. He did at first but I noticed him continue to steal glances at her now and then.\n\n He approached me a while on after we got home, giving me a hug knowing I was upset and asking what was wrong despite knowing why.\n\n He’s a thoughtful guy, v. considerate, but when I opened up, his response was laughter- almost hysterical, and calling me crazy. Reminder that he is fully aware of the fact that I suffer from confidence issues and insecurity. I know that that is not his burden to carry but mine, but he always reminds me that he will always be mindful of it- yet wasn’t.\n\nHe left me alone. The more I thought about it, I became more upset about the fact that his response was laughter and calling me crazy over staring at someone else. He heard me crying and came back and, this time, listened as I explained to him why I had reacted the way that I had.\n\nI do not blame my SO at all, neither am I upset at the girl. She was gorgeous and obviously my SO appreciates beauty just as I do, just as anyone does. But with knowing about my issues and still blatantly staring while I was in front of him- of course that really hurt me.\n\nAm I the a-hole? Or just over sensitive? Or have I just lost the plot? Or maybe all three.", "When I was an undergraduate in school \\~1999, I needed private loans in addition to federal loans to pay for school.  My dad offered to loan me the money with **terms of 8.75% interest starting at disbursement (while I was in college)**. I was 20 at the time and certainly was not at all financially with it, and I felt it was either take the loan or not attend college.\n\nAfter college, I basically refinanced my federal student loans around 2004 likely everyone else to 3.5%. While I was in medical school and graduate school these loans and interest were deferred while I finished my training. During this 15 year period after college, my dad had not mentioned a single thing about the loan to me. I presumed he had decided to forgive them, but I didn't ask directly.\n\nI came back home for residency training in 2015 and my Dad surprised me and wanted me to start paying the loan off. With \\~15 years of interest the amount came to a staggering \\~45k. I was shocked. Not only because this was the first time he had brought it up, but because I now understood the terrible loan terms.  Had I gone to a bank the loan would be far less due to refi.\n\nHe did not accept that excuse and held me to my contract.  My mother intervened a bit and he laid off.  I still gave him 11K in 2016 which was what my wife and I felt like we could do (we were paying for IVF at the time).  Then the situation was dropped. Didn't hear back again.\n\nSo now we are at present in 2019. I have a first job finally in my hometown (partly to be close to grandparents). My wife and I have a 3 year old toddler that spends time with my mom and dad and she loves it and they love her. The galaxy was at peace.\n\nI get another text message from my dad asking to pay off the loan.  I meet him in person and remind him that I don’t feel like the loan terms were good and offer to pay about half, **basically to 20K** like I would have paid a bank.\n\nNow my wife and I make decent money. We are in the 90th percentile for household salary. But paying over 30K to my dad was not in the cards. At this point I'm feeling pretty angry now since I thought we had settled a lot of this. My parents are not hard up for money. They both have good pensions, own a Hawaiian condo where they winter for a couple of months. Complicating the matter was that my older brother essentially had the same loan from him and paid it off with those bonkers terms.\n\nLater this evening I get a text from Dad basically threatening to disown me and never talk to me if I don’t pay him back over the 45k.  I expect him serious.  Part of me, like him is stubborn, and I'm willing to burn this relationship down. He's 70 now and I think he'll need me more than I'll need him.  My mother knows nothing of this so far.\n\nAITA for not agreeing to his loan terms?\n\n**Edit:** posters had suggested that I put in where the money originally came from. My father took a home equity loan two years prior to issuing the loan to me (probably to help my brother finish college). He took 75K out from what I know, about 16K was used to pay for my schooling. From what I know the loan was closed in 2013", "Let me explain. The other day, I took the bus to work and all seats beside the priority ones were full (no one were standing) so I sat in one of them and put on my headphones. I kept an eye alert in case someone who actually needed the priority seat got on the bus. And at some point, a man approached me very bluntly and raising his voice \"are you pregnant?\". I looked at him and answer no and then he said I should give him the seat then. I looked at him in disbelief \"you don't have to yell at me\". I was willing to give him my seat even if he doesn't seem like he needed because I'm aware some disabilities are not easy to see. But his answer was \"I'm autistic\" looking at me as if that was reason enough for me to jump out of the seat and justify his behavior.\n\nI know that for some people with autism is difficult to modulate the voice tone to the situation but I also feel he was being openly rude. I don't think being autistic mean you get the priority seat over a neurotypical person. I might be wrong so AITA?", "As you may or may not know, Instagram sends a  notification every time someone “unsends” a message to someone else. My friend, who has anxiety, has a habit of sending long fragmented messages and if she doesn’t receive a response within a few minutes, she unsends every single message because of her anxiety. This means that I (and the other people she texts) also receive individual notifications for every message that has been unsent. I had a feeling that she wasn’t aware of this as I couldn’t fathom the idea that she would want to bring more attention to herself if she’s scared that she’s been ignored, so I asked her if she was aware that this happened, and now her anxiety has heightened and she’s blaming me for not letting her be ignorant since she’s now realised the hundreds of notifications people must get from her unsending messages. I didn’t want her to find out in a way that would hurt her, such as someone getting irritated by her habit, but now I’m wondering if I should’ve let her stay blissfully ignorant?", "Seems pretty obvious to me but I am getting a lot of shit from people at my work right now. Work at a hospital as a resident doctor. One of the nursing assistants left a half eaten plate of food in the nursing pod. I get in in the morning and it’s sitting out, was covered by another plate but still disgusting since it’s out where patients walk by and I threw it away. My coresidents gave me a hard time about it saying I shouldn’t throw things away without asking and even one of the medical students said something like wth? There is a staff lounge where people eat and it is literally right around the corner and is a designated area for people to eat. If you don’t want your half eaten food thrown away don’t leave it out in the middle of a patient floor at the hospital. AITA?\n\nEdit: No judgements toward nursing assistants but to everyone saying I’m the asshole for throwing away a nurses food, this was not a nurse. They have downtime throughout their shift, especially overnight, they have scheduled breaks in which the other nursing assistants cover if someone needs vitals taken right away. The nurses at our hospital will set up at a computer , typically can tell and I’m not going around with a JAHCO checklist policing the hospital; honestly don’t care. This food stank, was out in the middle table where no one keeps personal food items and appeared to be old.", "So a bit of backstory, I play piano at the markets in my town, and make a bit of money off it too, in order to pay for my piano lessons. There's this chick who I met a few years ago (I'll name her M), although never talked to because she was one of those typical kids who were 'too kool for everything' and just an overall dick. anyway, This year, she's randomly been talking to me a whole bunch, and I've been responding with my general enthusiasm to be polite, although I never really liked her. After a while, she started to become a sort of tolerable person, and I'd almost consider her a friend. (Friends in my eyes are much more than most people consider them to be, So naturally I don't have many) Anyway, one day, I was sitting in English, and a mate of mine was asking how much I make from busking piano. I told him, and then M randomly pipes up, and says \"Can you fundraise for me?\". I asked her what for, and she said \"Family members of mine from \\*CountryName\\* had to sell all of their belongings and are having to sleep on the ground with no food, water or anything and are dying! Can you fundraise one day for me? I can pay you! $100 here is like $100,000 in their country!\"From this, My initial thought was: Firstly, I don't think that's how money works. It may be a larger value, but it's still proportionally the same money, secondly, I've never ever heard of the country she stated and thirdly, What do you mean you'll pay me? if you can pay me for it, then why not just send them money yourself? anyway, I tried my best to very politely skirt around it, Making perfectly valid reasons as to why I couldn't, but she kept going at it. I then again, politely dismissed it. She then said \"What's up with you always saying no to things?\" And I felt really bad after saying that, but kept to my point, and told her it's not happening. The next part caught me really off guard... She said -And I quote- \"Fine, Don't think about the dying person then!\" At this point I didn't know what to say... I just sorta sat there, Jaw dropped like those typical movie clichés.. I eventually turned away and dismissed myself from the conversation, as she said \"Wait I was joking\"I can't help but feel really bad, but at the same time, I personally don't think she was telling the truth, and -given her history- thought she was just looking for money to use for a specific malicious intention, But thinking that makes me feel even worse! Am I the bad guy here?", "Saturdaymorning, kids (2yo and 7yo) wake up, I ask hubby to take morning shift with the kids as I took last weekend. He gets out of bed, grabs his covers and pillow. His intentions are to feed the kids then sleep in the sofa. We have talked about this often and I do not feel the kids are safe this way or the house. He said we should agree too disagree and He should be able to sleep in the sofa during his morning shifts,that he has made a habbit of it.  \nI just feel he does this to get out of his morning shift as he knows I can not sleep when he does this.  \nSo right now He is sleeping in the bed and I am furious and in need of judgement.  \nAm I the asshole for demanding he stay awake and keep our kids safe during his morning shift?", "So, I was at my cousins (7) Birthday Party and we got up to the pinata. There was about 20 kids hitting the pinata and I was no. 20 since I am the eldest (15) at the time. When it was my turn the pinata was pretty banged up. So i picked up the stick and hit with all my might. Which was quite alot since I played baseball for school.\n\nUnsurprisingly, it broke and my cousin started crying since he didn't get to smash it. Then i got berated by his mum for not forgoing my turn just so he could hit it. Which i thought was pretty unfair.\n\nSo Reddit, AITA?", "My mother is remarried to a guy that my brother, sister and I don't like. She's known how we feel about him pretty much their entire relationship. My brother has a 2 year old, a 6 month old, my sister has 1.5 year old twins, and I have a 1 year old. We refer to this guy by his name only, and make sure to correct ANYONE who thinks he's our father. \n\nRecently he asked if it bothers us that he calls all our children his grandchildren and we all said yes. Yet he claims that since he's been around for 20 years we should just get over it. Hell post on social media saying it, he'll send text messages saying it, and when I had my baby he was so quick to tell the nurse that he is such a proud grandfather. Even in front of my father in law who is a legit grand father. \n\nAre we the asshole?\n\nEdit: a lot of people asked for more details so here's goes. Btw I very much appreciate everyone's feedback here\n\n1) it's not just my brother, sister and I who hate him. Everyone dislikes this guy. My uncle(mom's brother), my father hated him, cousins and other family members. Even people.who barely interact with him grew to dislike him only after a few interactions. \n\n2) there's a very long history here (20 years worth) of reasons why we don't like him. He makes up stories, telling multiple people the same story with the details never matching. Never holds a job for longer than 6 months to a year. Even my wife who tries to see the good in everyone said recently that it hit her how many jobs he's held since her and I met (10 years). \n\n3) my mother and father were very civil and friend when they separated. They coparented as best they could. Then this guy got involved and began to put his two cents into their parenting and this caused a lot of friction. \n\n4) my father sadly passed away 2 years ago. He was only 56. My brother had his daughter roughly 6 months before my father passed. And with my father being sick and unable to be around his granddaughter, my step father would post on social media at every opportunity referring to himself as a grandfather. My brother asked him to stop because he felt it was disrespectful to our actual father. So he stopped until that December (3 months after my dad passed) when my sister had her babies and started immediately posting about how he's a proud grandfather to 3 beautiful grandchildren. So we had to tell him again. Then almost 9 months later I had my baby and AGAIN he started posting about himself as a proud grandfather to 4 perfect grandbabies. \n\n5) he has a daughter who has a baby of her own. No relationship there. He hasn't tried to have a relationship with her since maybe 2 years after I met him. He acts like she doesn't even exist. \n\n6) us not liking him isn't a new thing. Before my mother and him got married my mother asked my brother, sister and I how we felt about him separately. We all said we didn't like him and didn't trust him. That was over 15 years ago. And there have been many convos and arguments over the years where we've made it clear. \n\nI can go into much more detail but I think that covers a lot of what is being asked. Please feel free to ask me for any other details.\n\nEDIT #2 - it seems like I need to explain further what our problem is. Our request is that he ease up on constantly posting to social media with captions saying \"my grandchildren\" or \"proud grandparent\". We've all explained that our father, their real grandfather is not with us and cannot post any pictures with them. We all feel like it's very disrespectful to him to do that. We'd prefer he never called them his grandkids, but in person we can't stop him from doing whatever he wants. There are reasons we don't want him to be around our kids that much. \n\n1) he had to be told numerous times not to pull his paper towel out of his pocket and wipe out kids faces with it. \n2) he had to be told multiple times not to put his fingers in our kids mouths. \n3) we've all asked him not to bring our kids into other rooms and out of our site. \n4) he has an addiction to pain meds and we never know when he's high from them\n5) he falls asleep in the middle of the day on the couch and would absolutely fall asleep with them in his lap or just fall asleep and let them roam unattended\n6) he's not a hygenic person and we just don't feel comfortable with them around him\n7) there was an incident recently where he was watching my sister's kids with my mother and my sister has a camera so she can check in here and there. She got a notification of movement and the video shows him very creepily staring at the camera, he pretends to move the board games stacked next to the camera around, here's my mother coming back from putting the babies to bed and sits down, when she steps out of the room again he quickly gets up and turns the camera. The camera stayed that way until about 15 minutes before my sister and her husband were getting back home.", "For a little context: my group of friends is pretty tight knit and have known each other forever. All of us share a common love of cooking, grow food in our gardens, brew our own beer/kombucha, and like to experiment with ingredients. \n\nOne of my friends recently hosted an end of summer potluck and all of the usual suspects were there. Everyone made something and most people’s dishes included something they had grown themselves or was a new dish they were experimenting with. My partner and I made some granola bars that used berries from our garden, whole nuts, homemade granola, etc... they looked like normal granola bars. But one of the ingredients that was “invisible” was cricket flower that we used for additional protein and binder for all the other ingredients. It’s important to note that cricket flower is literally just dehydrated crickets that have been ground into a fine powder, so it would be impossible to know what it was just by looking at it. \n\nWe put them out on the table with everyone else’s stuff, and later in the day someone asked who brought the bars bc they liked them. We got talking about how we made them, which is pretty common conversation with this group, and I mentioned that one of the ingredients was cricket flower and he made a huge deal about it, saying how gross it is and that is was messed up that I would feed people bugs without telling them what it was. A lot of the other people at the party were pretty grossed out by it too, even tho many of them had already eaten and enjoyed them. I know everyone that was there fairly well and I know their dietary restrictions seeing as we cook for each other all the time. \n\nI feel bad bc yeah, it is an unusual ingredient and some people might find it gross, but I wouldn’t have mentioned anything ahead of time if I had used some other unusual seed or spice (and neither would anyone else in this group). I guess bc this was an insect a lot of people are telling me that it’s different and I should have told everyone ahead of time what was in the bars. Am I the asshole here?", "[deleted]", "EDIT: I removed the word \"sullen\" from my description of my wife's demeanor, I didn't realize it has negative connotations. I was not trying to say that my wife was acting moody or childish or to be dismissive of or insulting to her.\n\nRestoring classic cars has been my hobby for the last 15 years. My wife has always been fine with this, but she's never been interested in cars herself, which she told me pretty early on when we started dating. This was the same conversation where she told me about her deceased brother, who had died about 2 years before we met. Here's basically how the conversation went:\n\nMe: I'm into cars, are you?\n\nHer: Not really. My brother was really into cars when I was growing up, though.\n\nMe: You'll have to introduce us sometime.\n\nHer: He died a couple of years ago. But he was an army mechanic, that's how much he was into cars.\n\nShe clearly didn't want to talk about her dead brother, so I didn't ask her any more about him. This whole time (8 years now) I've assumed that he died in the army and my wife has never volunteered any details about his death.\n\nSo fast forward to this weekend, I picked up a car at an auction that I've been trying to get my hands on for a long time. I don't want to give myself away, but it's the equivalent of a \"rare collectible\" and I have the potential to make a LOT of money restoring and selling this car.\n\nMy wife didn't see the car until I had brought it home and it was sitting in our driveway. We have an established budget for my hobby so I don't run purchases by her beyond that, which she's fine with. But when she got home and saw this car, she broke down crying and told me for the first time that her brother died in a car accident in the exact same make/model of car.\n\nShe hasn't asked me to give up the car, but I can tell she would like me to. Usually I work in our driveway but I've been hiding this car in the garage the last couple of days so she doesn't have to see it as much, but she's still ~~kind of sullen and~~ obviously upset when I come in from working.\n\nMy plan is to just finish restoring the car and then sell it asap. But my buddy told me that I'm being an asshole and I should just scrap the project, is he right?", "Throwaway, mostly bc my main account is very recognizable and my SO could easily figure out its me. Also please excuse length and formatting. I’m on mobile AND I’m bad at summarizing lmao.\n\n\nI am in a LDR with my SO. He lives in the US, I live in a non English speaking European country. Specific, I know, but it’s important.\nWe have been together for more than 5 years, and I just know he’s the one. \n\nSadly. where he lives he’s unable to afford university and find a job that he has a vocation for (sciences). Instead he’s forced to do a very labor intensive job that doesn’t pay well and leaves him exhausted and frustrated.For this reason, and many other (among which me absolutely refusing to move to the US) he plans on moving here with a student visa next year. No problems, my family is more than happy to help him, and I’m teaching him the language. I 100% plan on marrying this guy and being with him till I kick the bucket.\nSince we are very open and, not to brag, have great communication, we’ve already discussed things such as family and possible children.\n\nNow, here’s the problem. He insists on giving his own name to a possible future son. He argues that it’s a family tradition (his father has the same name as well) and is very vocal about it. So far I have only stated that it’ll be a discussion for later as we’re both still young and I don’t plan on having kids for a few years still. \nBut the truth is, I HATE the idea. Not because I don’t like his name, but because\n\n1: it would feel so incredibly awkward to call my child the same name I cry out during intimate moments. I felt the exact same way when I found out he has the same name as his dad, but it’s not like I can complain about that. \n\n2: this name is English, and not only that, it’s a weird one at that. I live in a non English speaking country, and children with foreign names here are known to be ridiculed and bullied. Having been bullied most of my school life for many reasons, I know what it feels like and want to avoid it at all costs for my future kids. \n\n3: lastly, this name would curse him to a life of “huh?”, “what’s your name again?” And several butchering. I know because I have a fairly weird name myself, it’s in my language but it’s very rare and I’ve gone through my life constantly being asked about it or bullied about it (see point 2) and it’s very annoying.\n\nIt’s not a problem yet but I already feel like TA for being so viscerally against this.\n\nSo tell me reddit, AITA?", "A little background here:  Me and my wife have been separated for almost two months now and expect to be divorced in the next month or two.  She works from home doing in-home daycare and watches two kids that go to school with our kids.  Because she doesn't drive and I don't mind, I drop-off and pickup the kids from school every day.  This includes the two that she provides after-school daycare for.\n\nOne of the parents messaged my wife today and told her that they were going to be busy on Monday and  wouldn't be there to pickup their children.  They had a sitter lined up at their house starting at 5PM (when my wife's daycare ends) and wanted to know if I wouldn't mind driving their kids home because the sitter is only 16 years old and isn't very comfortable driving yet.  My wife said yes on my behalf and only told me about it afterwards.\n\nI work from home and am allowed two 15 minute breaks a day, which I already use to pickup kids at 11AM and 3PM.  So I would have to clear it with my boss to take another break to take home two kids that aren't my responsibility.  Honestly, it's not that it's that big of an inconvenience but I'm afraid if I don't set boundaries now then she will continue to try and use me as her shuttle.\n\nI went ahead and told her she should have consulted me beforehand because the answer is no and she says she didn't ask me because it's a 'no-brainer' and by saying no I'd only hurt my own reputation in town.\n\nSo, AITA here?", "In my home town, there's one dedicated group for Dungeons and Dragons for teenagers. I, (16 M), joined a running campaign. The campaign was extremely serious and grim dark. I created a human bard who's a big nerd for music theory who's overly friendly, but also quick to anger. I have a nasty habit of getting caught in the moment and saying stupid shit. That cultivated to a head when we were fighting the BBEG and I called it a 'big dumb shit face' using Vicious Mockery (A spell where you insult a foe and it hurts) and it kills. Me and one other guy out of a group of eight are the only ones laughing. \n\nWe'll call the guy who laughed 'Chris'. He becomes important later. Both Chris and I and friends with the DM. Throughout the campaign I did a few, kind of minor jokey things. The DM pulls me aside and is like, 'you fucker, this was my big moment and you made a stupid joke.' Keep in mind, we are all awkward and hormonal teenagers.\n\nDespite what I felt, at the time, triumphant, I now felt like shit. I apologized, I took my stuff and left. I actually in retrospect feel bad. Later the DM sends me a strawpoll over Discord showing the majority of the group decided to kick me. One voted not to kick me. Obviously I'm angry, but it's not like I didn't expect it. I send a good bye message to the group. I kinda get ghosted by the group, which made me feel worse. I was a mess for a bit because I felt like an idiot and was confused, but then I decided to stop pitying myself and resolved to make my own campaign with my own players, one that wasn't as grim dark, one that was serious but also had a lot of room for comedy and jokes. I create a world and invite five people who were not involved with the previous campaign and to my surprise, everyone joins. This is where it gets bad.\n\nI run session zero and hey, these new players are pretty good, they roleplay and interact. On the cusp of starting the actual first session, Chris wants to join my campaign. I asked him like 'Hey, aren't you still apart of DM's campaign?\" He was like, \"Yeah\"... in something I probably shouldn't of done in retrospect. I said yes. New group mates love Chris and his char. This is when things went from bad to worse. \n\nI receive a message from old DM and he is *furious*. He said that I was so shit at Dungeons and Dragons that I needed to steal his players to have any chance. Apparently Chris jokingly shit-talked old DM's campaign and gave old DM the heads up that he was leaving to join mine. \n\nNow, supposedly, over Discord messages between Chris and old DM, they argued over me and now hate each other and I'm being used as the arguing point. By connection to Chris, old DM hates me too. One of the members of the old group sends me a message saying if I hadn't made a new campaign, no one would be arguing and that we'd all still be friends and that this is my fault... which still doesn't add up because they ghosted me after I was kicked so I'm not sure most of those guys were even my friends. \n\nAITA?", "I think I'm not TA but people got triggered when I told them so I'm questioning if I am. \n\nI have this one lady who works at my school, and I dont even know what she does. She always called me kiley (my name is riley) and she always freaking touches me. I tell her every day not to, but she keeps doing it. I always ask nicely, bc I cant stand being mean, but as of tomorrow, I've had it. I looked her in the eye and said \"dont touch me.\" In a very strong and obviously irritated voice. She said \"I'm staff, it's ok if I touch you *sweetheart*. \n\nI should add, these aren't light taps on the shoulder or a supportive hand on my back or something. They are her grabbing my arm (I had my hand raised) and patting my backpack really freaking hard. \n\nI seriously dont think I'm TA. But apparently im just \"overreacting\" and being \"rude for no reason\".", "This has been bothering me for a while, so I figured I’d post it here and get the clarity I need. I am a support worker for autistic kids, and have been working with my current family for about 7 months. This family is very dysfunctional, mom is not in the picture and the kids are aged 4-8. Most workers drop the family after a month or so due to the screaming and fights, it isn’t the nicest looking place either. \n\nI’m employed through a nonprofit that in turn gets funding through the state, the child’s father is not my employer. I am there to watch one child, the oldest, yet I do little favors to help out the other kids. I can’t say no to them when things are already so rough at home. Anyways, about a month ago the other support worker freaked out, cursed out the dad, and suddenly used her 2 weeks vacation time to leave. I ended up picking up the slack and went from 3 days to 5-6. \n\nThen I was also watching the second oldest child for a few weeks. Dad offered me money in exchange for watching her but honestly I wasn’t going to take 10 bucks from a man who clearly needed it more than I did so I refused. Next day dad asks me to go to the store with the oldest and grab milk, he gives me a WIC card (government assistance). We go to the store and I don’t realize you can’t use WIC at self checkout, I’m socially awkward, so I pay the 3 dollars for the milk and we head home. I tell them the situation and that I had to pay with my own money. He says, “Oh. Thank you. I don’t have any money right now.” I just say okay and head out for the night, it was the end of my shift anyways. \n\nNext day is Saturday and he had plans to take the kids out to the lake. I told him I couldn’t go, and he freaked out about me being a huge part in going and I was needed. I told him that I didn’t have the 40 dollars to fill my car up with gas to go to the lake. My job reimburses me mileage but not immediately. It wasn’t even that I did not have the money, I was just mad that he offered me 10 dollars for watching his kid, then next day he doesn’t have 3 dollars for milk, then day after he has the money for gas and snacks for the kids to go to the lake? After working 2x as many hours and refusing his money for watching the kids multiple times, buying them food, taking them out, the one time I asked for compensation he did not have it. I felt taken advantage of. I found out from his girlfriend later that they never even went to the lake that day due to not being able to afford it. So why did he yell at me for “ruining his kid’s day?” I had been working extra days, and he had the day off so it’s not like they were needing someone to be there. I do feel bad for not being there to entertain the kids though. AITA for bailing on my autistic client and his siblings?\n\nTL;DR: Dad is on hard times, I work extra and beyond my job description to help out. The one time I ask for compensation he refuses, only to yell at me for not showing up/wanting to spend my personal money to take his kids to the lake the next day?", "Good Afternoon everyone,\n\nI suppose this is more of an ethical question than a legal inquiry, but wanted to explain my family's situation and see if I can please get everyone's thoughts on the matter.\n\n My sister was arrested for her third DUI last night in Fairfax, VA.  Her first DUI was in Montgomery County, MD, second was in Philadelphia, PA.  I do not know the exact details of each case as I live in a different area of the country, but she miraculously still held a valid driver's license and served very minimal jail time (one year) for each.  My understanding is that her license has been revoked by the State of Virginia at this time.\n\nVirginia basically takes no shit for DUI's and I imagine she will be serving some serious prison time.  My mother and father depleted their joint bank account on attorney fees, restitution to the city (damage to a city gate and light pole), short-term rehab stints, and therapy for my sister, but this is the last straw.  I DO have the money to pay for attorney fees, but feel that she is beyond help at this point.  She will not get help or listen to reason.  She blames everyone else for her problems.\n\nAt the end of the day, my parents have faith in her recovery and have been begging me to pay for my sister's legal fees which will no doubt be out of this world.  They've been calling, texting, and e-mailing me non-stop -- her boyfriend has been calling me and guilt tripping me as well.  Even her co-workers have been trying to contact me to which I finally turned off my phone and .. here I am.\n\nMy sister is not a bad person, I promise.  She is addicted to alcohol.  I love her dearly, but am very angry with her for essentially deterring my parents from retiring and putting such a financial strain on them in their golden years.  She also could have seriously injured or KILLED someone not once, twice, but THREE times.  On the flip side, I feel I will be turning my back on her if I don't help her out - they say family is everything.\n\nI'm very sorry to vent, I am just very frustrated and conflicted.", "[deleted]", "[removed]", "Whenever I go to a restaurant I usually end up ordering from the kid's menu\nI do this mainly for two reasons. I Am a really picky eater and the kid's menu usually has some sort of food that I'm used to and I like that. The second reason is the kid's menu is almost always cheaper than the adult one and it's usually easier to prepare too. The reason why I'm asking this is that I was at a restaurant this morning with my family and I ended up ordering several meals from the kid's menu. The waiter apparently did not like this because she looked me up and down, glared at me and asked me if I was sure I didn't want my food from the adult menu. I felt kind of bad afterward and I want to know if I'm in the wrong for this ?", "I was letting someone in my group in class take a look at the list of the names and phone numbers of the people in the group so she could copy it to be able to contact us. \n\nWithout asking, she licked her fingers to turn the page to take a sheet of paper. I took my notebook away from her because I could see the page was actually damp with her spit. I told her that that's gross and that she needed to ask for a sheet of paper and not rub her saliva on other people's belongings. I tore the page out from the opposite corner of the spit, along with the page after it because it looked like it soaked through.\n\nShe got offended about me taking the notebook away from her and \"making a big deal out of nothing\" because she \"just wanted some paper\". I don't think it's making a big deal, and personally feel that \"I will not allow you to rub your saliva on my belongings for any reason\" is a fine boundary to set. \n\nSo, AITA for taking my notebook out of her hands for licking her fingers enough to make two pages damp?", "[removed]", "My parents have a flight at 5:30, so they want to get there at 4:30 AM. We’re about a 10 minute drive to the airport. They want me to drive them, but I don’t think there’s any reason for me to get up when they could take an Uber/Lyft. An Uber costs about $8 to get there. I wouldn’t have a problem taking them if it weren’t at a crazy graveyard hour of the morning. I told them I would even pay for an Uber myself, as I’d obviously rather be sleeping \n\nThey think I’m inconsiderate for not graciously agreeing to wake up and drive them. I think it’s inconsiderate of them to wake me up at 4:30 AM when they could take a cheap rideshare that I offered to call for them. Am I the ass hole?\n\nEDIT: I work a 9-5 during the week, and their flight is on a Saturday. I don’t have work that day, but it’s technically my day off\n\nEDIT 2: The crowd seems to be pretty split here. Thanks for the replies. I’m gonna drive them, as it really isn’t that big of a deal. I’m happy to help em out. I was just genuinely curious if I was the ass hole for my initial reactions. I don’t think I was wrong", "[removed]", "[removed]", "I’m a 25 y/o Male. A few days ago I went to a bar with a tinder date. \n\nI texted a friend of mine what she was doing that night and she said she was going clubbing with our group of friends. About an hour later she texts me asking me if I was still going to the bar and what time I’d be there. She made it seem as if she wanted to come.\n\nThe convo went like this:\n\nHer: Are you there yet? \n\nMe: Yeah\n\nHer: Do you have to pay to get in?\n\nMe: Yeah but don’t come if it’s just you though.\n\n(She replied before I could explain)\n\nHer: Wow \n\nMe: I’m on a date and that might make it awkward lol \n\nMe: It’s not personal it would just be weird if I went on a date with her and brought a female coworker you know. A group would be fine but just us three would be weird.\n\n\nShe didn’t reply.\n\nWas I an asshole?", "My girlfriend's libido has dropped recently, and she said she doesn't have much interest in sex. I have needs so I bought a fleshlight, and she thinks that it's rude and mean. Meanwhile she has 4 vibrators, 2 that I have bought her, that she uses regularly. AITA for buying myself a sex toy?", "I’m 20, she’s 20. We go to the same college. Met her at her sorority philanthropy event. We hit it off and become good friends. I was attracted to her the instant I met her, but I had the good sense to not go head over heels over essentially nothing. There are plenty more girls on campus, and she gave me no indication that she liked me, so I decided On being friends with her completely platonically. So, we became really good friends. We texted almost everyday over the summer, despite being hours apart. She said a few things that made me feel like she wanted a relationship and things become more apparent that she wanted to be more than friends when we got back on campus. Eventually, I received enough green lights to just ask her out. It became evident very shortly that she didn’t feel the same way about me. As soon as it became clear to her I wasn’t joking about a date, she started tweaking out. She told me she’s going through a lot of drama with her friend group and doesn’t really feel like she has anyone to turn to but me. I knew about the drama, but I never knew I was that important to her. She told me she saw me only as her closest friend and expressed that she was scared we would stop talking. She kept saying it was shitty of her to not make it clear that she didn’t want to date me. \n\nBasically, I told her that 1) she wasn’t a bad person for not wanting to date me 2) she didn’t explicitly lead me on and it was really just me misinterpreting our relationship which is no one’s fault and 3) id still be friends with her and that it’d be shitty of me to leave her based solely on her rejecting me.\n\nA few days pass on and she texted me to tell me that she felt like her fears were coming true, as I texted her /asked her to hang out much less frequently. She basically wanted to know if this was me “recovering” from the breakup or a permanent thing. I told her honestly that this would be a permanent thing. When we were in what I perceived to be in a weird limbo between friendship and dating, it’s only natural that I was gonna invest more time into her, more so than I would with my own friends. After all, most people spend more time with than SOs than their friends. I’m a double stem major and I try to keep very involved in clubs and fraternity affairs during the school year. I just don’t have the same amount of free time I used to have in the summer, especially now that classes are ramping up. \n\nI texted basically what I wrote above to her in clear and respectful paragraphs. She responded by calling me, presumably either crying or on the verge of crying, and telling me that she expected me to be different from all the people in her life that just apparently use her. I tried to form a response but she hung up and won’t pick up or respond to any texts. It’s obvious that she’s been going through more than she let on about her personal life and I feel really bad about basically leaving her all alone in a time like this, but I honestly don’t think I did anything wrong.\n\nSo did I fuck up?", "My boyfriend (21M) and I (21F) live together and are both in college. I work a part serving job, he has a job where he gets paid about 250 per job, but the job is only 3 hours long, and he only gets a booking like once maybe twice a week. Therefore he makes a just little bit more than I do but works a lot less Than I do. and he eats a lot more too. A lot of the time he eats more of the food because he’s home more often. I’m out a lot more than him because I work a part time job, volunteer, and go to school. Being a little tight on money I asked him to split the grocery bill 75/25 since I’m not home as often and I don’t eat as much as him anyways. He thinks it was a ridiculous thing to ask, as it’s my fault I don’t eat that much and that I’m not home to eat it. To be fair, his reasoning is that since I’m not eating it, it will go bad anyways and he wants to eat it. Anyways am I being out of line by asking him split the groceries 75/25 since he eats way more than me?", "I'll try to be concise to get under the character limit. If things appear ambiguous, I can clarify in comments.\n\n&#x200B;\n\nI am 27 male, single dad, very straight, progressive, mostly liberal. Everyone in my friendship and family circle is straight, to my knowledge. I've only dated straight women. \n\nMy unofficial GF is 31 female, no kids, and has a \"fluid sexuality\" (which I thought meant \"bisexual\"). She has been in 2 LTRs. I was under impression that they were both with men for over 2 months, but she corrected me last week, and told me they were with women. She always used gender neutral expressions, but I always referred to her exes using male pronouns, and she never corrected me. This inspired some of my current insecurities, but I think I understand her PoV, which was that she wanted us to be more serious before she told me and wanted me to like her for she is and not be affected by the gender of her previous partners. \n\n&#x200B;\n\nI've known she has a fluid sexuality for almost 2 months now, and it never bothered me. But since she disclosed her ex's gender last week, I've been feeling somewhat bothered/insecure, and I've asked her a lot of weird questions related to her sexuality to ease my mind.\n\n&#x200B;\n\nSome of these questions are:\n\n\"When did you start crushing on men\" -- she said \"I've always crushed on men\"\n\n\"would you date someone you're not physically attracted to?\" --  she said \"no\"\n\n\"Did you enjoy sex with your male partner (she told me she lost her virginity to a male when she was 19, and he was only 1 of 3 sexual partners)\" -- she said \"yes\"   -- Weird question, but I think you guys probably knew my intent. \n\n&#x200B;\n\nI could never date a woman who is not physically attracted to me, but she's always made comments that indicate that she is sexually (we haven't had sex yet) and physically attracted to me. She tells me that she fantasizes about us fucking in various positions. She also told me that she physically and mentally masturbates to these thoughts (she told me she can orgasm without ever touching herself o.O). But at the same time she said she's a prude.\n\n&#x200B;\n\n&#x200B;\n\nAITA for asking these kind of questions related to her sexuality or feeling bothered by her exes both being female? \n\nAITA for having some concerns that she might be a lesbian under the hood? \n\nShe seems patient with my questions, but I kind of feel like I'm doing something wrong but asking or feeling insecure about her sexuality.", "I’ve always been really family-oriented. I’m pretty guarded but I get sentimental about anything to do with marriage or families, even in movies. I’ve been a groomsman a couple times and kept thinking about how great my turn is going to be. Telling your wife that you love her and will care for her forever in front of all of your friends and family is really meaningful to me and a memory I want. My fiancee is aware of this.\n\nMy fiancee has anxiety. She’s pretty good at recognizing it and being rational about it even though anxiety definitely bothers her and very obviously affects her behavior. Once we had to go to two of my coworkers’ parties in a row and she spent the second one pretty much hiding until we could leave. She quit therapy after a year because it was expensive and she didn’t think it was helping. She has a take-as-needed medication that helps some.\n\nEven though I wanted a big wedding I was prepared for a medium wedding with just people she knows well. However, she clearly doesn’t want a wedding at all and is just going through the motions for me. She was really quiet when we were visiting venues and I ended up just picking one myself. She hasn’t been involved in anything else about the wedding, which is frustrating because I wanted to share that experience with her but our families and I are handling it. I’ve been telling people that she’s too busy at work to get involved. I asked her if she really wants to get married and she said she does but wants to elope.\n\nShe’s clearly going to hate this wedding and she gets sad and distant and a little passive aggressive when I talk to her about stuff like my bachelor party (the bridesmaids are relatives she isn't close to). I want to give up sometimes but I think about standing at the alter with her and making those memories with my family and friends and it’s worth it. My mom and I had a pretty deep talk while looking at videographers and it was a really great moment in our relationship. However since I know my fiancee’s going to hate this wedding and how triggering the process is for her, am I an asshole for making her go through with it? I know weddings are supposed to be more about the bride than the groom but it’s something I really want.", "I (30F) recently moved into a house with my bf (30F) in a nearby city. We’ve been together a few years, and have talked very seriously about our future, he’s even talked in certain terms about getting married next year, but he was adamant about buying the house prior to anything marriage related. \n\nHe was the one to buy the house (I am not on the deed, I pay him rent) as I don’t want to buy property with someone I’m not married to. We’d already lived together for a year and a half or so before moving into a house. \n\nI know he’s been gearing up to propose (my mom accidentally spilled the beans when he came to ask her permission... 😬) but I haven’t said anything to him, I know he’s trying to make it a surprise and he wants it to be special. \n\nLast night I was looking for something and he told me to check his office, specifically a couple sets of drawers. I went up to check and in plain sight in one drawer, was a ring box. I opened it but as soon as I realized what was going on I immediately shut it and felt terrible. \n\nI went back to him and he asked if I found what I was looking for and I said “hey, you should be careful telling me to look in those drawers, there might be something people aren’t supposed to find in there” and he gave me an odd look and then it clicks into place and he carefully asks “well how did you feel?” And I said “happy and excited of course!” And he starts smiling and is like “well you’re just gonna have to wait!” And laughs. \n\nI let it go after that, since I then felt bad for even mentioning it but since he’d sent me to that drawer specifically I wasn’t sure what to make of it. He claims he forgot it was in that drawer and I should just “forget about it”... but it’s tough. \n\nHe knows how important this commitment is to me, and he’s continued to talk about our wedding next year as if it’s a given it will happen. I want to talk to my family and friends about it and share my excitement over our life together, but since he hasn’t officially asked I’ve been keeping my mouth shut. \n\nSo here’s the WIBTA part... I’m really tired of waiting around. The convo with my mom happened almost a month ago. A couple months ago when the wedding topic came up, I kind of gently was like “hey, I’m excited too, but just know, I’m not making any plans or arrangements because you haven’t asked yet” and he said he understood and just to hold tight because it would be “soon, very soon”. \n\nAnd meanwhile I’ve made the commitment to move with him to this new city. While I’m happy and I don’t regret moving, it makes me anxious that he hasn’t made the move to take our relationship to the next level. \n\nWIBTA if I tell him I’m tired of waiting? I’m pretty sure I am TA, and I need to take a chill pill, but I’m so sick of waiting. I hate the idea of an ultimatum but I’m worried the end of the year will come and I’ll still be exactly where I am now. \n\nTL;DR: tired of waiting for bf to propose", "We bought our first home together in May after years of renting and I want to take care of our investment. She's a bit of a slob, though. After talking to her twice about something, and her failing to stop the behavior, I hang up a small sign, typically a Post-It with tape:\n\n* Next to the toilet: Flush me when done or my bowl will stain\n* Next to the blender: Keep me upright or my bearings may seize\n* On the trashcan: Close my lid or I attract flies\n* On the kitchen sink: Run my disposal when discarding food or I clog\n* Next to cleaning supplies: Close us when done or we dry out\n\nI do feel like a bit of a pedant when hanging these signs, as if I'm educating a child on how to take care of things. But if she needs these reminders, that's fine by me, they don't bother me, and I'm not being judgemental about *her.* Edit: clarity: I'm insulting myself here, not her.\n\n\n\nShe however has told me I'm being passive aggressive. To me there's nothing passive about it: in every case I had alread talked to her twice about the problem. Likewise there's nothing aggressive about it: I'm not angry and I don't think less of her, I simply want to solve a problem.\n\nSo which of us is the asshole?\n\nEdit: thanks for the responses, all.", "We live on a street with public parking. For a long time it was just my SO and I parking on the street in front of our house. We ended up getting neighbors on both sides of us that can't parallel park. We helped accommodate this problem by having one of us park in front of an abandoned house at the end of the street instead of in front of our house. Now each neighbor had plenty of room to park and one of us was still in front of our house. \n\nRecently our right side neighbor has started to park further up so that there is enough room for me and my SO, we just have to parallel park (which neither of us have a problem with).\n\nOne night I was already at home and my SO was lined up to start parallel parking behind me. Our left side neighbor arrived home just seconds after him, pulled up next to him and said \"you can't park there\". My SO pulled up and parked down the street and the neighbor circled the block and parked in front of their house. My SO got out and asked them why he couldn't park there and she responded \"well it's in front of our house\". My SO responded that it is a public street, he can park where ever, and he would have been in front of our house but the left side neighbor would have had to parallel park. They admitted that they can't parallel park but that we should park further up so that they have enough room in front of their house to park. \n\nMy SO told me all of this and I got very upset because we had been trying to help them and now they are telling us where we can and can't park. I decided to start parking right on the fence line between our yards. This meant that I parked inches away from her a couple times but she still had half a car length behind her so she could get out. \n\nShe started parking more and more past the fence line in front of our house and I continued to park right on top of her. One day she got pissed and after I went back to work after lunch I saw her on our security camera come out, complain to our other neighbor about how close I was, get in her car and move it even further in front of our house despite having a full car length behind her. When we got home my SO parked in front of her and I parked behind her pinning her in for the weekend.\n\nIt looks like she called her parents to get her out and parked down the street. My SO and I had the opportunity to keep her spot blocked but decided to open it up and give her the chance to start parking in front of her house again. \n\nI watched her on our camera move her car to her spot and park on her side of the fence. She got out of the car,  saw that we would have room to park in front of her, got back in her car and moved in front of our house again. \n\nAITA for pinning her in? WIBTA if I went to her house and told her that she made the rules of not parking in front of each other's houses. She needs to follow them.\n\n\nUpdate: After having her pinned in for the weekend we decided to wave the white flag and opened the spots back up. Monday she parked in front of her house, and even though there was plenty of room for both my SO and I to park in front of our house my SO parked down the street and I parked in front of our house so the neighbor would have plenty of room to get out.\nWe assumed everything was back to normal.\nToday she parked in front of her house and her boyfriend, who usually parks in their parking spot behind their house, is parked in front of our house. There is just enough space between their cars and surrounding cars that you can't quite park in between them. \nSo now my SO gets to park down the street in front of the abandoned house and I get to find a spot around the block.", "I'm a pretty private person and as a rule don't kiss and tell, but recently I made an exception to this rule and pretty much every queer friend I have in my life is split on if I did right or wrong.\n\nThere is this guy (lets call him John) who I met a while back during a party a mutual friend of us were holding. We hit it off but actually didn't immediately hook up and instead developed a friendship which soon turned into a FWB situation. I was pretty surprised when he came onto me given he seemed so straight laced, but I was pretty open to it and let him keep it on the down low out of respect for where he was on his journey. Eventually John ended up moving when he graduated and our relationship ended there, but thing were still amenable and we talk from time to time.\n\nRecently I found John deep in the comment section of a relatives of his comment section, debating against the normalization of gay relationships and gay adoption. I was pretty shocked by this and pretty much immediately sent him a private message asking why he was arguing against queer rights when he himself was queer. Rather than respond normally he just responded with \"?\". Literally just that. Then continued on with his hateful point of view right after.\n\nI admit I got a little wound up over that and after I saw him post more hate right after sending me that, I publicly asked him why he was against queer people and queer relationships when he himself engaged in them and linked something about self hating homosexuals. Pretty much immediately things blew up, I got a ton of furious messages from him and a bunch of people took notice and it's apparently gotten really big. He blocked me then unblocked me to send a tirade at me asking me what the fuck I thought I was doing making up these lies (another thing that just blew my mind) and telling me I was fucked in the head. I also got a ton of messages from mutual friends of ours asking if this was true and asking me to spill the beans.\n\nI thought I was in the right and was pretty resolute in that but the mixed reaction I've got from my friends has me wondering if I was too harsh. It's been a few days now and as far as I know he has not actually faced serious repercussions over this, just a lot of curiosity and gossip. Was AITA here?", "Okay, so the title sounds like this couldn’t have happened...but it did.\n\nLittle backstory, I was stationed in Turkey in 2010 when I met my gf (now wife) on base.  We went out more than a few times but this one situation STILL GIVES ME FLASHBACKS!\n\nAt one of our dates, we go to this open air cafe.  Instead of normal sitting chairs and tables, this cafe has large couches (the kind you can really lean back) plus large and long tables that are only about knee high.  \n\nThis cafe we went to served coffee, drinks, desserts, hookahs,  and meals.  They also had large TVs where you could watch the Turkish League soccer matches...which is still odd for me but whatever.  Its a total switch from the boring routine of chow hall food I get everyday.\n\nWe place an order for drinks.  When the server returns with our drinks, my gf is leaning back on the couch with a cigarette in hand. She says something to the server...then he moves the salt and pepper shakers from the middle of the table so they are directly in front of her!  Thats when this conversation starts...\n\nMe:  Did you just ask the server to move the salt and pepper shakers to be in front of you?\n\nHer:  yes why?\n\nMe: seriously!? \n\nHer:  whats the big deal?\n\nMe:  why couldn’t you get up and get them?\n\nHer:  I didn’t want to, besides thats his job.\n\nMe:  No, his job is to bring them IF they are NOT at the table.  Not to move them closer...that would totally not be acceptable in the States.  I think if you asked that over there, the server would’ve walked away.\n\nHer: I see nothing wrong with that.  I wanted them closer.\n\nMe:  are you that lazy to not get up and get your own salt and pepper shakers from your own table?\n\nHer: Don’t be an asshole and let it go!\n\nWas I really an asshole for saying that to her?", "This is going to get a bit complex. It also shows how small the world is.  I’ll call my friend Katie. We’re childhood friends who aren’t as close as we were, but that bond from surviving childhood together is strong. Her almost husband is Ryan. My coworker is Chelsea. I’m a bridesmaid in Katie and Ryan’s wedding. \n\nKatie and Chelsea don’t know each other— they’ve heard of each other and all but have never met to my knowledge. Katie and I live about 1.5 hours from each other- I live in a big city, she doesn’t. I’ve never been a huge fan of Ryan, but he’s not my partner so... eh. He works in sales and is often out of town, including some weekends. Chelsea doesn’t have facebook and is only occasionally on instagram. \n\nChelsea came into the office last Monday declaring she had the GREATEST WEEKEND EVER and met a new guy. She was gushing. She basically told a group of us how she spent the weekend with him. She told me his name was Ryan and he was from a town about three hours away, but I didn’t think much of it — it’s a common name, after all! Plus, Katie’s Ryan lives only 1.5 hours away, and I have no idea of his work schedule. \n\nFinally, someone said they needed to see a picture of “Hunky Ryan.” She pulls up a string of 5-10 selfies — SO NOT CHELSEA LIKE — and to my surprise, the guy was The. Ryan. I asked Chelsea to go out for post-work drinks and spilled that Ryan is my childhood friend Katie’s fiancé, and they’re set to get married next month. Chelsea was understandably upset, but encouraged me to tell Katie. Unbeknownst to me, Chelsea’s high school/college sweetheart cheated on her as soon as they graduated from college half a decade ago. She was Team Fuck Ryan. Chelsea offered to speak to Katie, if Kate wanted. Chelsea told me that in their time together, Ryan talked about prior recent hookups, though she has no information of if those are true accounts or not. \n\nI told Katie and it was... hard. To say the least. For Katie more so of course. I gave Katie Chelsea’s number. Katie never reached out, which is fine.\n\nFast forward to this week. I got a long email yesterday morning from Katie saying that she knows Ryan has always struggled with commitment (?) and she believes he had cold feet, which led to an “unfortunate mistake” that they “wish to put behind them as they prepare for marriage.”\n\nI feel uncomfortable standing up in a wedding where the groom was recently so cruel to his fiancé. I believe this is very likely only the first time Ryan has gotten caught, not the first time he’s been unfaithful. At the same time, Katie is a lifelong friend. \n\nIs it an asshole move to drop out of the wedding? Should I suck it up? Help me reddit!\n\n**ETA: I’m a bridesmaid. I would be fine with going to the wedding, just standing up to give my support makes me feel.... weird.**", "Sister's wedding is coming up and my parents have sat me down and said I am not allowed to wear a short sleeve shirt due to my sister not wanting my tattoos on show in wedding photos (she was supportive in me getting my tattoos even though my parents were not, she even was excited and wanted to name the doves on my arm...) none of my tattoos are offensive and I paid a lot of money for a very good artist, Most of my tattoos are family and heritage based.\n\nI've kicked up a little bit of of a stink about this, they are part of me, I feel quite let down and my parents have told me to stop gloating and that I'm being unfair as it's her special day not mine. AITA for getting pissed off?\n\n*Edit* I will be in some photos but I am doing most of the photography for the event, this isn't a large wedding, just immidiate family\n\nSecond edit - I am wearing a long sleeve shirt, this was decided as soon as she asked me, her wedding her rules I am fine with that and wouldn't jeapordize our relationship over it. I feel it would be handled differently if I asked her to dye her hair a natural colour on my wedding day", "Basically the title. My husband was playing online (I think COD), talking to teammates, when I said this to him.\n\nHe keeps leaving his clothes on the floor around the house. I already have a toddler to pick up after, I shouldn't have to pick up after him, too. In fact, I even bought an additional clothes hamper that stays in the living room/entry way so that he can throw whatever he takes off once hes home, into that hamper. Yet the clothes still end up on the floor. I've told him this bothers me and he always apologizes and says he will fix it but it doesnt get better.\n\nAnother thing, hes almost always playing online video games when hes home. Dont get me wrong, my husband works 60+ hour work weeks; so I dont mind his gaming sessions. But that means other people hear our convos a lot.\n\nToday was my breaking point and I just straight up called him a child because of it and he was really angry with me for \"saying something so disrespectful\" while others could hear me. \n\nI get where hes coming from but idk.\n\nAITA?", "This past Friday I noticed two people at the end of my driveway and went out to talk to them. It turned out they were the prospective buyers of the house next door. They explained they were in my driveway/sideyard because they were looking at the neighbor's fence and trying to ascertain if metal fences were allowed.\n\nOne of the first things the prospective buyer's wife said was that it may not work out because the house needs a new roof. I said that a lot of homes in the area have been getting new roofs lately and we just had ours replaced 4-5 years ago.\n\nMonday I get a knock on the door and it's the sellers (husband and wife both). He asked if I'd met them and I said that I had. He then claimed they were trying to back out of the contract because I told them the house needs a new roof. I explained to him that I didn't say that and I know nothing about his roof so I wouldn't ever make a comment about the life of his roof.\n\nHe said that he had 3 people tell him that I said his house needs a new roof and I told him that I don’t care how many people he had tell him that because a lie is a lie no matter how many people he hears the lie from.\n\nThis went in a circular fashion maybe 3 times with him accusing me, my telling him that it was untrue, him claiming that 3 people told him I said that, and my telling him that I don’t care how many people said that. It might have continued longer except my wife got irritated and came to the door and loudly stated, “Why would he EVER try to ruin your house sale when WE WANT YOU TO MOVE?”\n\nAt that point he started yelling about it and then walked away shouting about how I better never set foot on his property again. (I had met a person on his lawn a week prior while he was away on vacation and talked to them long enough to ascertain it was his real-estate agent. I thought I was doing something nice by keeping an eye on his place while it was for sale but the way the real estate agent tells it I was all over his property--it was maybe 15' in reality.)\n\nAfter checking my security footage I discovered that I actually have video of the buyers in my driveway telling me that the house needs a new roof. Since he asked me not to step on his property I tried texting the proof to him and since I got no response I parked my car in front of his place with a screenshot of the video taped to the window along with a note that said “I even got the conversation on video. Asshole.”\n\nThe next day (I’m fairly certain he saw it by then) I moved the car back to my driveway and took down the sign in it. To amuse myself, I made a professional looking sign on an H-Frame that says “Neighbor Roof Inspections! Free opinions now!” Along with a functional email address… it was like $5 to register the domain and $5 to make the good looking sign. I put that sign out in the yard. It's funny to me and my wife and meets the townships municipal code for signs but it is also clearly meant to troll the guy.  \n\n\n[https://ibb.co/HYknKYm](https://ibb.co/HYknKYm)\n\n&#x200B;\n\nAITA for that? did I go too far?", "My english class is freshmen level so its pretty much and intro class. About half the kids are international students and I am paired with two of them for a group essay project. They sent me their drafts to read and some of the sentences don’t make any sense and any sort of meaning can’t be derived from it. The essay has to be 10 pages so either I would have to write the essay myself with some of their own ideas from their drafts or let the drafts be and get a poor grade for bad grammar and it be confusing. I was thinking about talking to my professor about switching to go by myself and would have a smaller essay to write. Would I be the asshole?", "Bought a $300 4k TV. We got home and I noticed a small dent/cut in the middle back of the box. I thought it's probably nothing and I could always return it if there were any problems. You couldn't tell until it was turned on, but when we did it was completely shattered. Especially in the middle where the box dent was. I loaded it into my own car, and there was nothing to cause the dent anywhere, kept it vertical - although it was a snug fit.\n\nI called the next morning, they said no problem, bring it back for an exchange. \n\nBrought it back and the cust service woman is nice enough, takes it out and plugs it in. She had  a coworker come look, then they got the manager. The manager looked and left for a minute. Then came back with the news I knew was coming seeing as how long it was taking: \"We can't do anything for you because our employee checked the box before it left the store - so the dent must have happened after that. We can give you a discount on a new TV\". I told her to check the cameras from last night and show me there is no dent in the box I received. If no dent I'll gladly leave with the broken TV. Of course she declined, saying they don't do that with customers. At this point I was losing it. The other employees stared at the ground. I got into an argument tone, but not yelling. A couple lines I dropped were \"So you're calling me a liar? Your employee doesn't make mistakes?\" And \"why would I not shop at Amazon and have it delivered to my door for the same price? There would be no questions if it arrived damaged.\" She said I could call corporate or see another manager, which one would I like? I said both, get me the other manager. They prob knew I was staying at that counter until the police take me out.\n\nA couple mins later she comes back, says they have a new policy and they will exchange it for a new TV, because they can't prove it wasn't damaged before leaving the store. I accepted, but was still pissed that I had to get pissed for them to do what they should have done from the start. I made them open the new TV and turn it on right in front of me (should have been done the first time). I don't like getting nasty, but if I remained a gentlemen I'd be out $300. If it was $1000 tv I may have jumped over the counter.", "My twin brother and I are, for the most part, fairly mature, reasonable adults, and productive members of society, but something about each other brings out the Cain instinct.\n\nEvery time there's a birthday or Christmas we all gather in one place and for a few years my brother and I have had an ongoing competition to buy the ugliest possible shirts for each other. So far the ugliest shirt I've given him is a hawiian shirt decorated with cats in tacos and the ugliest he's given me looks exactly like a bowling alley carpet.\n\nWe've never worn the shirts before now, but the last time he gave me a shirt (Nigel Thornberry as Miley Cyrus) I managed to cough while drinking and spilled coffee on the shirt I went out in. My brother told me to go put on the shirt he bought me to replace it. I went to the bathroom and put it on, and wore it until I got home.\n\nA few nights later I went to meet my brother for drinks and he was wearing the taco cat shirt. I saw this as a challenge, and since then we've both started to wear the ugly shirts when we see each other. Our girlfriends are amazing enough that not only have they accepted this, but they join in.\n\nIt didn't cause issues until last night. My girlfriend and I are in her home country (Ireland) for a week, and in I'm meeting her parents for the first time.\n\nMy brother offered to give me a lift to the airport and because he was involved, I wore a shirt he got me with the main character of Bee Movie on it.\n\nAt some point during our flight her parents decided to meet us at the airport instead, which we didn't see as we were on the plane. We got out of the airport and she immediately saw her parents and told me to put my jacket on. My zip got stuck so I was left staring down my girlfriend's parents with barry fucking benson on my chest.\n\nI tried to explain the game with my brother, playing it off as a joke, but they just drove us to the hotel silently and then went away. They're coming back in the morning. My girlfriend said that while I was checking in they told her that just from this interaction they knew we weren't a good match.\n\nMy girlfriend is upset with me, but only a little. She said that if she'd known that was the shirt I was wearing on leaving the flat, she'd have told me to leave it at home, but also feels like I should have known not to bring it along. She says I was the one who said that I wanted to make a good impression on her parents, and I should have known that this was not the time or place for the ugly shirt competition. I don't disagree with any of that, but the way I see it I have a week to fix this and I only anticipated her and my brother seeing the shirt. If I'd known her parents would be there I would have changed. She still says that even though she believes me, on the way to the airport to meet her parents is still not the time or place for the ugly shirt game.\n\nAITA?\n\n&#x200B;\n\nEDIT: Alright, so me bringing the shirt on it's own wasn't the end of the world, and my girlfriend is laughing about it now, but in a situation where she's 99% certain her parents have it out for me and are desperate to prove that we shouldn't be together, me showing up with a dumb shirt was a terrible idea, and it would have been better to just wear a plain shirt than picking out this shirt solely to prove a point to my brother.", "[removed]", "My job requires me to travel to many different office buildings in the Tristate area. Because I tend to travel frequently, I use and rely on, the public men's rooms in these office buildings. There is a specific building that I visit probably 3 to 6 times per month. (In this case, I am doing work for the building itself, and not any particular company, in any of the suites, inside the building.) For whatever reason, the public men's rooms in the hallways/common areas of this building are all locked, on every floor. This forces you to go into one of the suites and request a key from the front desk employees of the particular company leasing that space. The women's rooms are NEVER locked, on any floor, in any area. (And yes, this bothered me enough that I have checked every restroom, muliple times.) I complained to the building manager earlier this year about this situation, to which I received the reply that she, \"didn't realize this was happening, and it would be addressed.\" I returned later that week, and found the men's rooms still locked, but not the women's rooms. I then spoke with her on a separate occasion about this, to which she said she, \"forgot, but will address it today.\" Since then, I have been back to the building 9 times, all of which I found the doors still locked. (About 3 months have passed since the inital conversation.) I tried calling the building manager on 3 separate occasions, with no response. (I suspect she is avoiding me.) Because of this, I met with an attorney last week, and he sent a formal letter to the building manager that if this situation is not remedied, we have no choice but to pursue legal action on the basis of discrimination. AITA?\n\nUPDATE: I just heard from my attorney this evening. He has recently spoken with the building manager. She claimed that \"it is their policy to lock ALL bathrooms, not found in suites, as a matter of public safety during business hours.\" ?????????? When questioned on why it has been consistently found that this is not the case, and ONLY the men's rooms were being locked, she gave ambiguous, nonsensical answers. She asked that I not visit the property any longer, even though I have contracted work to complete onsite. My attorney will be reaching out to the owners of the building, as there are multiple things wrong here. This is an odd situation. I'm going to assume for the time being that she is simply out-of-touch with the daily happenings in the building she manages, or is misinformed about their own policies.", "My ex and divorced, but we both remarried. We have two kids together. She was married to \"Doug\" for eight years and had no kids. My ex passed away a few years ago. I was okay with Doug spending time with my kids because it was good for them. But now they're teens and doing their own thing and don't want to kick it with him or with me for that matter. Doug still comes around like we're friends. We are not. My wife and I are busy with work and we have two kids of our own. I get it that Doug has no friends or family and is lonely but he's wore out his welcome. It's time to move on. \n\nI thought about breaking it down to him that he needs to basically get a life. Not to be mean but that's what he needs to do. I'm not interested in becoming bros with the dude who my ex cheated on me with let alone a guy with whom I have nothing in common with.", "I've known this friend since highschool and since then we've been best buddies. He helped me a lot, I helped him a lot. However, when it comes to women, we are different. Of course.\n\nHe likes the fancy, skinny, wealthy type(although he is not any of those). Those type of women who play with men for fun. I kept warning him about some of his choices in the past. And of course, at the time, everything I would warn him about, would turn out to be true. And he kept coming back to me, apologizing etc.\n\nMe, well. I like all type of women as long as I can get along with them. That's all you need to know. My current gf, is chubby.\n\n&#x200B;\n\nWhenever I hanged out with my friend, he would trash-talk chubby/fat women(because he despises them), and I, being a friend, would laugh.\n\nRecently, I've posted a pic with my gf. He asked me who she is, as he had no idea because Ive never posted anything related to her before.. I said she is my gf. And it starts. He started saying she's fat af, calling her names and so on. I got mad of course and started arguing with him. I've spilled out the truth about his \"love life\" too, we got more and more mad and blocked him... and unblocked him. Now, we don't talk anymore and it feels a little bit shitty.\n\nI mean, friends are important to me and one of them was gone in the blink of an eye.\n\nAITA for being so harsh with my BEST FRIEND?\n\n&#x200B;\n\nEDIT:  I just said that( Those type of women who play with men for fun. ) because he got played by everyone he cared about, even if I warned him. Don't take it the wrong way. He likes women who are... way out of his social circles. And for that, they took advantage of him. I am not generalizing or anything. This is simply his taste and what he gets himself into.", "My friends and I decided to go on a vacation to visit our friend (we will call him Allen). Allen lives on the other side of the country. My other friend (we will call him Bob) decided he wanted to join in on this vacation. Now I want to preface something about Bob, and I am including this information because it is relevant to the story. Bob has been unemployed for a while and he dropped out of school. The only reason Bob could afford this trip was because his mother decided to let him use her credit card for the trip. \n\nThis wasn’t a cheap vacation, and this incident occurred on the 4th night of our trip. Allen, Bob, and I decided we would go bar hopping for the night. The three of us arrive at our first location, and Bob decides (without telling us) that he wants to get the first round of drinks and buy us food. Bob shows up to our table with an expensive appetizer and drinks for the three of us. My mind immediately thinks, “I hope his mother is okay with him buying us food and drinks with her money” but I decide to accept his offer and we enjoyed the food and drinks together. The bill ends up being 70 dollars.\n\nNow the night goes on and the three of us end up getting a good buzz. We arrive at our third bar for the night and I decide to buy a round of drinks for them so that I can return the generosity. I end up getting us some drinks and it comes out to about 35 dollars. Once the drinks arrive Bob made a comment to me that really put me off. Without even thanking me for the drinks he says, “Alright, now that you’ve spent 35 on us you just need to spend another 35 since I spent 70.”\n\nI found this extremely rude….especially since we never had any form of agreement that I would have to price match him and it is not even his money. Being buzzed and upset, I end up getting in an argument with him.\n\nMe: “That’s the first thing you say to me for buying you a drink!?”\n\nHim: “I’m just saying it’s only fair.”\n\nMe: “I don’t get why your mind goes to the price instead of just saying thank you”\n\nHim: “I am thankful, I’m just saying I spent like twice as much as you.”\n\nI ended up going off on him saying that he doesn’t get to decide how I spend the money that I earn, and that the money that he is spending is not even his money. This may have been a low blow, but I find it ridiculous that he was telling me how to spend my own money. I felt as if I was being guilt tripped into spending my money (after I had already spend hundreds on the trip) even though I never asked anything from my friend. We ended up talking it out, and the next day I decided to buy another round for my friends to make up for the tension that was caused. \n\nSo AITA for not wanting to price match my friend on our vacation?", "[deleted]", "So my SO recently went abroad to study until May next year. It‘s just a 2.5 hour drive and we‘re probably going to see each other every other weekend at least. We write each other during the day, but since we both have a lot going on during the day, it‘s not that much.\n\nObviously, it‘s an exciting time for her and she experiences a lot she wants to tell me. I‘m fine with that, I like to hear how she‘s doing and want to be sure she‘s ok. \n\nFor me, telling someone what happended during the day, how I feel about that and stuff like that takes something about 10 minutes. My SO can hold a monolog for 30 minutes and still not be finished. And if I say monolog I mean it. I sometimes try to make it a real conversation, but either I‘m cut off or too tired to process all the information fast enough.\n\nUsually this wouldn‘t be a problem at all. I want to talk to her, I‘m interested in her stories, I want her to feel she can tell me anything. But currently I‘m under heavy workload with 12+ hours work every day. Sometimes I just want to fall into my bed and sleep. Sometimes I don‘t want to phone for an hour when the essential stuff can be said in 20 minutes. Tomorrow‘s another day, maybe I‘m more in the mood then.\n\nAlso, during her monologs she often digresses. Like stuff that is totally unimportant and that has no relevance whatsoever, which she herself has recognized a few times. But if I complain about that, it‘s a no-go. \n\nA few days ago, I just couldn‘t bear it anymore. I was tired as hell and my SO was talking to no end about some unimportant stuff, while she hasn‘t touched the important info she wrote me before. So I asked her whether she could ‚speed up a bit‘ so we could talk about the major news. She snapped at me, said she felt unappreciated and how mean I was. I figure she‘s still somewhat pissed as our phone calls have been noticeable shorter the last days.\n\nThis isn‘t the first time we had a fight about our phoning habits. But since we‘ve lived together for the last year, it didn‘t come up until recently when she went abroad.\n\nAITA for telling her that I‘d like to change our phoning habits when I‘m not in the mood for hourlong phone calls or should I try to be more appreciating and understanding?", "[deleted]", "So I didn’t think I was wrong in this situation, but have been told by numerous people that it was an asshole thing to do. \n\nI (22f) went to see the Lion King remake with my younger sister (19f) a few weeks after it came out. \n\nNow, it’s a Disney movie, so obviously some amount of noise from kids is to be expected/acceptable. But this one family was way, way over the line. The kids were running around screaming, running up and down the aisles, jumping down the steps, climbing on the seats and half walls (this was a cinema with electric leather recliner seats, so if they had of been trapped between the walls and seat, they could have been badly injured) \nThey were being ridiculously noisy and out of control. \n\nNow this isn’t just annoying for the adults watching the movie, it’s unfair to the other children in the cinema, the ones who are actually behaving. \nNot only that, but letting a child run unsupervised around a dark room full of strangers is incredibly stupid and dangerous. \n\nI tried to just ignore them, but it was impossible, so I went out and complained to the workers. They came in and quietly talked to the family and gave them a warning. \nThe kids continued to treat the cinema like a playground, and the worker came in and asked them to leave. \n\n\nI’ve been told that causing them to get kicked out was wrong because it’s a kid’s movie, and I should just ‘deal with it’ but these kids were way over the limit of normal/expected noise. \nLike I said, it’s not just unfair to my sister and I, but also to the other families who were there. Like, why should the quiet, well behaved children have to suffer because little Timmy in the front row can’t sit quietly for five minutes, let alone a whole movie?", "So, am I a bad parent for allowing my children (9f & 12f) to ride an Uber home from school instead of picking them up myself? I am a self employed working mother.  I spend approximately 2 hours of my day driving my kids to and from school. The school is only 10 minutes from home. But because of lack of parking and the general chaos at school at pick up time, I spend an hour at each time I pickup or drop off. \n\nIn the past I have always been able to find other parents to carpool with. My children attend a small private school and finding other parents in our neighborhood to carpool with can be difficult. This year I was not able to find another family to carpool with. So, I’ve been looking into other options. \n\nThe best solution I could come up with to arrange for an Uber to pick my children up from school. In the country where we live, children are permitted to ride alone in an Uber. I made arrangements with the teachers aide in my daughter’s class to help them find the Uber once it arrived. After the first 2 days, my daughter’s were able to find the Uber themselves and ride home. I ordered the Uber and could watch the route as they drove home. I work from home and am there to greet them when they arrived. \n\nEverything was going well until yesterday when one the teachers at the school found out that my children were ubering home everyday. Today I got a call from the principal, basically shaming me for my choice to allow my children to ride home unaccompanied. He stated, “I can’t believe I have to make a policy for this. Don’t you realize it’s unsafe for your kids to ride in an Uber alone? Because of you’re actions, I’m going to send out an email to all parents prohibiting them from allowing children to ride in taxis or uber to and from school alone”.\n\nI don’t agree with his suggestion that Uber is unsafe compared with other transportation options. Children at age 9 are allowed to walk home from school (this is what most parents at our school do. But we live on the other side of a busy highway and it’s not possible to walk). The school offers busing. But at $2,500/yr/child, it’s not affordable for us. Plus with the amount of bullying that goes on in the buses, I don’t see how that is a better option.  Another option is to hire someone to pickup my girls from school. I’ve done this in the past and will likely do it again now. But it is always a hassle when they are late or call off sick. One of the reasons I like Uber is because I know the drivers are insured and have a clean criminal record.", "[deleted]", "[removed]", "\nI [17M] was traveling with my friend and my brother, my brother booked a one way ticket as he was traveling to another country from our destination after two days.\n\n So we are at the airport and the lady at the boarding counter tells my brother because he is \"of a certain nationality\" he cannot have a one way ticket even though he had a ticket to his other destination. She says it has to be a return ticket through their airlines only.\n\n So we asked to speak to her supervisor because this was wierd as it never happened before and in some way I found it offensive. The supervisor wasnt really cooperative and kept telling us he was busy. So my brother went to quickly book a ticket while I called my dad to tell him what happened.\n\nMy dad told me this shouldnt be a thing and wanted to talk to the supervisor, but he refused and said I'm not allowed to speak on phone eventhough he literally hung up on someone's phone moments before I gave him mine.\n\nMy dad wanted to know who he is since he was being rude and possibly making us book an unnecessary ticket. so I asked him for his name tag as I wanted to take a picture of it. He refused to even show me it. So I took a picture of him and he started shouting at me infront of everyone things like \"who are you to take my picture\".\n\nBy that time my brother booked a ticket so I ignored him and headed towards the counter. He told the lady to not give us our boardings because he was gonna call the cops on us.\n\nWas it wrong that I took a picture of him or is it legal since he wasnt showing me his name tag?\n\nP.s. sorry if its too long and sorry about the formatting wrote it on mobile so excuse my grammar.", "We had a fight yesterday when he took out his laptop and started working in the middle of dinner. \n\nHis argument is that they're inexperienced new hires who need help (this is true) and I'm being unfair to them.\nI don't see how his company's staffing issues are my problem and just want to enjoy our dinner and free time without interruptions. I would even compromise and live with it if he would at least put the phone away for dinner.\n\n(I should add that in no way is my partner expected to take these calls - it's not in his job role. The new hires have a manager, but he's often unreachable after going home. My partner offered so they would have someone to call.)\n\nAm torn between still being annoyed and feeling I'm overreacting.", "So to preface, we have a 5 year old Siberian Husky, and while she's sweet, she can be a handful and has a history of chewing up siding and has caused other damage to our house.\n\nMy family has been planing a vacation across the east coast for a couple of months now, it's planned to be about a 10 day trip. Over the past month, my brother has been looking into local doggy daycares for Ridley to be boarded up in while we're gone. He had found some pretty decent programs that were nearby, and even did a tour around one or two. He had pretty much decided on a certain day care for Ridley spend the week at while we were on vacation. Que in my sister [17F] who starts suggesting that Ridley spend the week at her friends [17F] house (Sam). They also have a dog around the same age, and fenced in yard for the dogs to run around and play in. My brother was hesitant because he doesn't want Ridley to get anxious or excited because of the new environment at this house and possibly cause any damage, but the sister and the friend are both adamant that everything's gonna be OK. Sam had mentioned she had talked it over with her parents, and they love Ridley and would be happy to watch over her for us. Plus they'll do it for free (minus dog food and what not), so he'll be saving about $300 from not having to pay the day care. After some back and forth, my brother gives in and agrees to letting Ridley spend the week with Sam and her family.\n\nLong story short, they get back from vacation, and of course, Ridley has done some damage to their house, tore out some siding, chewed up one of their cages they tried to get her to sleep in, and some other things. Sam's dad is pretty upset and is wanting my brother to pay for the damages. My brother is pretty firm that he isn't paying anything. Sam's parents agreed to watch over Ridley and he even voiced his concern that something like this would happen, and they still knowingly wanted to dog sit Ridley. My sister and parents both think that my brother should foot the bill for the damages, or at least pay for some of the damages, but I'm kind of on my brother's side and that he shouldn't be responsible for anything.\n\nGranted, he probably could have handled everything better, like meeting with Sam's parents and discussing his concerns with them directly instead of having having everything go between my sister and Sam as his point of contact, since they aren't the ones who own the house, but Sam had originally said she talked it over with her parents, and they were fine with it as well. I'm pretty sure my brother will have to chock this up as a learning experience, and just pay them (which will probably amount to what he would have ended up paying the doggy day care) but just wanted to ask all you all here to see if we are the assholes for not wanting to pay for the damages done to the family friend's house?", "I’m not going to be able to make this post with any shred decorum so let’s just get right into it.\n\nMy boyfriend and I have been dating for a little over 5 months now. Early in our relationship I borrowed a pair of his favorite sweatpants and have been holding on to them over since. They are super cozy and he was alright with me keeping them since I loved them so much and had every intention of giving them back. I have always put in an effort to take care of them and not eat any messy food in them since I know they are not mine. \n\nHowever, over the weekend I caught one of those 24 hours stomach bugs. I was feeling a little woozy and decided to spend the night in. Everything was going alright but then the worst case scenario happened and I dashed for the bathroom. I, unfortunately, didn’t make it and ended up messing myself. I don’t want to get into gross detail but about the 1/3 of the sweatpants were damaged. I stripped them off and tossed them outside on my front stoop to deal with later since I wasn’t in the condition to deal with them then and there. The next 20 or so hours I was tied to the bathroom and spent the whole time on the bathroom floor. The next day I went to go deal with the sweatpants and they had attracted flies and were, what I saw, as a lost cause. They were a lighter grey color and I just didn’t know how much could be done so I wrapped them in a plastic bag and threw them away.\n\nMy boyfriend knew I was sick at the time but I didn’t tell him about the sweatpants until a few days later when I saw him face to face. He was extremely angry and wanted to know why I didn’t try to save them. I don’t think he realized how horrifying their condition was but he still said I should have tried. It turns out those sweatpants were more sentimental than I realized which is my mistake. They also cost more than I anticipated(~$70) which makes me feel terrible. I offered to buy him a new pair but he said it wont be the same. But, I still think that a diarrhea explosion warrants just throwing something in the trash. AITA here?", "F19 here, on mobile.\n\nI went clubbing with my friends last week. We were 3 girls, me and two of my friends. Both of them are very spontaneous and carefree personalitys, which i like about them, but sometimes being the only one in the group who is organized can be stressfull.\n\nWe were meeting in front of the club and since it was cold we were all wearing jackets, so they had their stuff in their pocktes. After we went in we gave all of our coats to the coat check guy and both of my friends put their phones and ID's out beforehand. Before we got to the dance floor, both of them asked me whether they could put their stuff in my purse because both of them didn't bring one themselves. \n\nThis has happended multiple times. Quite frankly i'm sick of it to carry their -pretty valuable- belongings around and that they just count on me being responsible all the time. Plus, 3 phones, car keys etc. are quite heavy and don't feel that good while you're dancing.\n\nSo i lied to them and said that i can take their ID's but there isn't enough space for their phones anymore. So they had to hold their phones in their hand the whole night.\n\nAITA for lying to them about not having enough space in my purse for their phones?\n\nEDIT: I told them to brinf their own purses the last time. Forgot to mention it, maybe it's important to the story, idk.", "\nMy younger sister (25f) and her husband had three kids very young. I love them like family but my partner (35m) and I (29f) are currently child free by choice.  We both have good jobs and work a lot and really appreciate our rare time off together.  Neither of us particularly like children or the stress and mess that comes with them. But family is family and recently my sister and I agreed to spend more days together with the kids so I could get to know them more as they grow up. I've enjoyed days as a group where I can enjoy the kids company but my sister and BIL can parent. I treat them to things, play games and make them laugh, it's fun but it's exhausting and it reinforces my decision to be child free. I appreciate getting to spend time with my niece and nephews though. \n\nShe's asked me to baby sit for her a few times overnight while she and BIL have a night out with her parent friends who usually babysit but everytime I've refused. I honestly just don't want to and I think that's my right. She's hinted that I don't deserve to spend time with them at all if I can't look after them alone and has threatened to stop me seeing them at all if I won't baby sit. If it were to help them out in a pinch I would happily do it but she's a full time Mum and I don't want to spend a day stressed and scared looking after three kids on my weekend.  AITA\n\n[Edit] Kids are 18months, 2.5yr and 4.", "We recently had an old friend come to live with us for awhile and help out on the farm. He arrived with 3 “assault rifles” which we were not told about before he came. I tried to not make a big deal about it and basically try and ignore the fact that they were here. To make a long story short and without giving too many details, our friend has not been in the happiest of head spaces and after a conversation about his dog that escalated to him yelling, I no longer feel safe in my own home. He was going to leave, but after my partner going and talking to him we tried to talk things out and come to some sort of compromise. He has agreed to take the guns off of the property when he returns home for a short period at the end of the month before returning to the farm. \n\nThis was yesterday, and after me leaving for the day to talk with friends and to process the whole situation I decided I was comfortable with him staying as long as the guns left. Last night I could hardly sleep though, and when I was able to drift off I would have bad dreams that would wake me up. This morning I tried to talk to my partner. \n\nI told him I was extremely uncomfortable and that I don’t feel safe while the guns are still in the house. I asked my partner to either have him take the guns back today, or for me to go and stay in a hotel/Airbnb until they are removed from the house. He thinks I am being extremely unreasonable, and I feel like he is being way too relaxed in allowing the guns to stay on the property until the end of the month. \n\nHe said that it makes no sense for me to be okay with him having a handgun or rifle (which is part of the compromise we came to), but not the assault rifles. The truth of the matter is I’m not comfortable with him having those either, but as we live on a farm with active predators guns are a necessary evil here. Honestly, it was a major adjustment for me to feel comfortable having and carrying guns on the property in the first place. \n\nAm I the asshole?", "So, my family went to Disney without me. My dad let me know in a voicemail, as he was returning a call I had about breaking up with my ex. I didn't call back, because my initial reaction was to be hurt. Namely, because I didn't feel included, and honestly, I'd love to go to Disney. They've gone now four to without me. It's not usually their fault, they go during times when I'm teaching.\n\nI guess I was feeling super passive aggressive, because I saw a post on my dad's Facebook wall of them at Disney. I decided to post, \"looks fun. Wish I could have come, too.\"\n\nApparently, it caused a huge fight within my family, and now the trip is ruined for them. I'll admit, I wanted it to be known I wanted to be part of the trip.  But I didn't intend to cause the hurt I did.\n\nI kinda feel like an asshole, so I'll just submit myself to y'all's judgement now.\n\nEdit: I tried to reach out to my dad, to ask to be part of the discussion when they do this, next time. Here was the response.\n\nhttp://imgur.com/a/tREL85k", "Three years ago I was depressed every day and on antidepressants and anxiolytics and self harmed almost daily. I thought myself worthless and was in depression deep. A family friend suggested I join their church and on a whim I did. I'm Catholic but nonpracticing, hadn't set foot in a church since I was in grade 3 or 4. I still don't really practice religion, but I do go to church because the community has been good for me. I made friends but more importantly I made friends who I could talk to. Everyone seemed to have my back in a good way and it helped me a lot. I like to think of myself as agnostic.\n\nA friend of mine is in a similar position to what I was years ago. She's on antidepressants and has confided in me she has dark thoughts sometimes. Trying to be vague here. I gave her the same advice I received and she was open to the idea but was apprehensive so she asked some of our mutual friends.\n\nThe vitriol I received was gargantuan. I had people message me out of the blue calling me a \"fundie\" and that I'm \"shoving my religion down her throat\". I don't even think I believe in God, I'm not invested in the church, only the people within. One of my friends said something more meaningful: I shouldn't \"prescribe religion to treat depression\", and that's true and fine. But I never suggested it was a cure or treatment. It helped me and if it can help someone else, I'd love to share it.\n\nAm I the asshole?\n\n[more info](https://old.reddit.com/r/AmItheAsshole/comments/d3q7ab/aita_for_trying_to_convince_my_friend_join_my/f04nfwr/)", "Happened last night. My girl and I walked into a grocery store to buy some chips and salsa and a few other things for a party we were going to. As we walked in, there was some spilled fruit on the floor and she slipped on them. She's since gotten a bruise from it. Anyways, at first no biggie. She's pretty tough and we shrugged it off. We go to the salsa section(which is right next to the entrance) and they're out. I ask this employee that was near if they had anymore in the back. \n\nDuring this exchange he was holding in his laughter with all his will(he saw her slip) and eventually bursted out laughing before saying there was no more salsa. He then walked away still laughing about it and it looked like he told another employee since he slightly pointed at us and they both laughed. Tbh this kind of pissed me off. I'm in my early 20s myself and worked at a few grocery stores and witnessed funny shit. I've always gone to the back if I really couldn't hold in it because I didn't want to treat the customer like that. My girlfriend told me she was pretty embarrassed at the employees laughter. \n\nTo her mild protest, I went to the front and reported the spill(for any future people entering) and also told the manager of the employee laughing(I was able to catch his name). Now I didn't directly say I wanted him fired but this grocery chain tries to hold a \"reputation\" of being high end so I was pretty sure he'd be fired.\n\n We then finished up our shopping and in the parking lot he walked up to us and basically said we got him fired. I didn't want to start shit so I got into the car and drove off. We then told this story at the party and the consensus was that I was an asshole for reporting the kid and should've only mentioned the spill to the manager. They also dubbed me as a Karen.\n\nAITA?", "[removed]", "Hey all. I’m currently attending University as a transfer student.\n\nThere is a girl in my class that I am really close to. She has had a hard time (both parents passed, bullied at her former college to the point she had to leave, etc). She is as sweet as can be, but she is struggling emotionally and mentally. Which, I understand why. \n\nThere is a girl in our math class who is just a straight up cunt to my friend. Mind you, my friend has never even spoken a word to this girl a day in her life. \n\nSaid girl rolls her eyes, makes nasty, rude and uncalled for comments, etc when my friend asks a question or says anything in class. She doesn’t even try to hide it and I see everything she does as I sit diagonally behind her. My friend has started to notice too and it’s REALLY bringing her down, literally to the point I’m concerned about her well being. \n\nWell, my friend came into class the other day without a bra on and the girl made a nasty comment to her friend “ew, look at that. She isn’t wearing a fucking bra. How disgusting” — my friend noticed this and almost started crying.\n\nI’ve personally had it with this girl. She’s a total cunt and I’m not one to let my friends, or anyone really, be treated this way. My friend has talked to everyone she needs to, but they aren’t really helping whatsoever. \n\nWould I be the asshole if I just told her she needed to drop whatever issues she has with my friend and grow the fuck up? Like, we aren’t in high school. This is college and this type of shit is so ridiculous and uncalled for.\n\nGranted, I wouldn’t say it like that. But you guys get the point.", "[removed]", " \n\nSo I work at Walmart, in Grocery Home Shopping, which is a whole different dimension compared to the rest of the store. to start off, About a week ago my manager pulled me into his office to bitch about wait times being too high, and that I'm not fast enough despite the fact that sometimes I'm literally the only one who is trying to work fast (or even at all). On some nights co workers just sit there and talk or look at their phone while I'm stuck having to explain to everyone in the parking lot why they had to wait 20 minutes. I later found out He didn't bother talking to the slackers. This pissed me off and kinda killed my motivation to do anything more than the bare minimum.\n\nFast forward to today we had 4 dispensers for the entire day, but we found out that all of us were going to be leaving before 8:00 (our closing time) my shift ended at 5:00pm Maria's at 4:00pm Alexandra's at 5:30pm and Jim at 3:30. We looked at the schedule to see if anyone was coming after we all left, and there was literally not a single associate scheduled after 6pm. soon, Gabe (the manager) rose from the darkest,of hell (happens once a year) to ask Maria if she wanted to cover the closing shift, to which she declined because she doesn't want to dispense anymore,\n\nhe turns to the rest of us, Alexandra had dinner plans already made and Jim had already disappeared at this point. So i was the only one without plans after work. Going back to what i went over in the beginning, i was bitter towards Gabe and not really looking forward for covering his ass considering he brought this on himself.\n\nI knew he still had options, using one of the support managers, or pulling one or two cashiers off a register, but naturally he chose to just clock out on time and let someone else figure it out. So i let the support manager know what was going on and quietly left 15 minutes late. there really weren't that much orders for the night, we finished every pick by 3:00 which is an hour before it is supposed to be finished, and there were only 3 orders to be dispensed between 6-7 and 4 between 7-8, so whoever is covering me while i sit back, drink a beer, write this post is probably just sitting around, waiting for the clock to hit eight\n\nThe reason i think i may be TA here is that;\n\n1. Some Support Manager who has like a million things better to do is sitting in the OGP backroom waiting for that one customer to arrive at 7:59\n2. Gabe's precious \"Numbers\"(wait times for groceries) that he bitched at me about might of taken a hit if there's no one there to dispense\n3. i may of indirectly hurt Alexandra because she told me she didn't want to just let Gabe take the fall, and may of stayed past her shift (i don't know if she did or not)\n\nReasons im NTA:\n\n1. I don't HAVE to work overtime\n2. Gabe is a doo doo head\n3. There wasn't that many orders, very slow night which is uncharacteristic for a Saturday\n\nAt this point its up to you to decide, cause im kinda torn on whether or not i should've stayed", "[deleted]", "I work away extensively and at the moment am doing Monday through to Thursday week. getting home late Thursday. It's a labour intensive job and I'm usually wrecked the Friday and come good Saturday Sunday. My S.O is doing placement and my excess pay is going towards paying her a wage so she can afford the 6+ weeks she can't work while doing unpaid placement.\n\nHer grandfather's second wife has just recently had a stroke and isn't doing well. they're worried she may pass away soon. her father is planning on going down to see them this weekend but my S.O is worried she may not last till then, so I offered to cover flights up and back with a 2 night stay, that way she doesn't add more time to her placement, which is time based. she is considering it, but really the weekend trip with her father would be ideal for the current situation. no more time added to her placement means less for me out of pocket, not even considering cost of flights and shit.\n\nShe's considering doing the weekend trip but has asked me to come with considering I get back the Thursday. I don't really want to. i feel like the 10+ hour drive after a 6+ hour drive home from work will be to much. I also have a mates 21st which I've rsvpd for 4months ago. I don't want to spend a whole weekend traveling again and then come home late Sunday just to spend 6+ hours on the road on the Monday. AMITA?\n\nTLDR. S.O wants me to come see her dying grandmother on my 1 weekend a fortnight\n\nedit: more info. her grandmother hasn't been in her life very long, neither has her grandfather really, but they do have a relationship and my partner is obviously upset. \n\nthe drive up would be shared between myself and the father in law.\n\nI want to thank everyone for all the advice. I've since offered to go and have roped my parents into doing a bulk of my washing for me while we're away (reminds me of high school). that way I'm not getting back Sunday and spending the whole day washing, only re-packing. The grandmother's condition has worsened so there's a possibility that it'll be a last minute rush for flights anyway but we'll just have to see how it all plays out", "I (32M) left my High School 14 years ago. In the UK, we refer to High School as Secondary School. Same thing basically. I stayed at the same school for my Sixth Form (age 16-18).\n\nI was bullied at this school. I was an anxious kid and unfortunately people were cruel. Teachers were apathetic. It was not a good time. I only began standing up for myself towards the end.\n\nI now run a successful business and it's made more than two million this past year. It's definitely known in the regional papers near that school. Well the school asked me to come back and give a talk + Q&A and I agreed.\n\nSchool just started back up last week so I came on the Friday. I was mainly speaking to the Year 11 (age 15 to 16) assembly. Had around 150 kids.\n\nSo I give my presentation on how I made my money and got my business running, and afterwards do a Q&A. I get some questions, but one question is what role I think school played in my success, I told them:\n\n\"Well, not much....I guess it motivated me to get out of this place. The kids were cruel and the teachers here, and I realize this will sound bad, but they're useless. I'm sure those of you getting bullied here will realize that...these teachers are useless, and I don't give a single one of them credit....only I am responsible for my success. My own sheer force of will resulted in my success\"\n\nThere were only two teachers overseeing this assembly, but they looked embarrassed and awkward...another kid asked me about bullying, so I answered with my own experience and the mindset I believe he needs to cultivate:\n\n\"I was bullied by this one kid...noone did anything even after I asked for help. In the end....I had to play fire with fire. I came up with a nasty rumour about the kid...which worked. His mental health tanked and he had to move school...you have to see your enemies as enemies. They're not your friends and people like that don't truly mature. You have to destroy those who seek to destroy you. That's the mindset I took in the business world and look what it's done for me.\"\n\nI had some of the quieter and shy kids come to talk to me after my talk, and I saw my younger self in them. I offered them work placements at my business (which would do wonders for their CV/resume) but I also instilled my mentality in them.\n\nNow obviously the headmaster confronted me after this, and he was the same one who was there when I was there, but I told him bluntly \"Your school is shit...you're always at the bottom of the rankings and in 14 years you haven't changed shit\". He flipped me off and told me to get out.\n\nOn the one hand I recognise I went too overboard, but when I say this school is shit, I mean it. The teachers here are sellouts. I want these kids to survive so I told them how I succeed. AITA?", "  \n\nMy bf Ben is one of those \"never met a stranger\" people. He’s  friendly, outgoing and makes friends easily and often. We live in a big city and he is probably the only person who knows all his neighbors by name and something about them. Ben has a lot of interests and meets new people (men and women) through these and ends up being friends with them and inviting them to other things. I don't really mind but it’s annoying when it’s a female bc there have been instances in the past where they get crushes on Ben and, although I trust him, I would rather not have some chick flirting with my bf (he doesn’t flirt back and usually stops inviting those girls or tries to fix them up with a friend). This past spring Ben met Leah through a running group. She was new to town, in a similar industry as Ben and they have tons in common. Ben invited her to trivia night. Leah is not only beautiful but she's funny, athletic and interesting. While I wasn't cold or mean to her I didn't seek her out in conversation and always held her at arm’s length. Turns out they are training for the same marathon so she also joined his long run group. Leah fit in with our friend group so she is around often. Since she and Ben are in the same industry, she's also at some networking things, too. I was getting tired of her being around all the time and a little insecure bc they have so much in common but they've never done or said anything that makes me suspicious. I've even glanced at their text exchanges (Ben asked me to look up an address she had sent in a text so I wasn't snooping) and there is nothing flirty or inappropriate. He's mentioned before that it doesn't seem like I like Leah and I've always denied it and said we just don't have a lot in common or I was busy talking to someone else. \n\nWell, a couple weeks ago Leah shows up with Jill and introduces her as her girlfriend. Ben says something like \"oh, its so nice to finally meet you\" indicating he'd known Leah was a lesbian. I won't lie- I felt a huge weight lifted off me and had more fun that night than since Leah joined our group. Ever since then I've talked to her more and found  I really like her. The other day, someone made a joke about how I was an asshole until I found out Leah was a lesbian and not going to steal Ben away. Leah laughed it off but Ben looked a little bothered and asked me later if that was true. I admitted that her being a lesbian made me more comfortable with their friendship. He was upset with me and thought that showed a lack of trust and faith in him. I told him that he knew I wasn't totally comfortable with their friendship and it would've been nice of him to tell me she was a lesbian. He said that he had just found out about two weeks before I did and that it wasn't his place to \"out\" her to me and he thought I didn't like her for something else, not bc I was jealous. \n\nAITA for only being friends with her after I found out she wasn't \"competition\"?", "I grew up in an upper middle-class family and my parents helped me out with education and a stipend to study. In return, my parents had input in my major and how I spent my time. I went along with it because of their generous contributions to my education and every-day expenses. They were very nosy and felt they had to approve my relationships as well. When I started dating the son of one of their closest friends, they were elated. I went along with it and we got married.\n\nWe had kids and I decided to stay home with them. When our kids were 4 and 2, I decided to go back to work. My husband was self-employed and had crazy hours. He wanted me to continue staying home with the kids. My parents always sided with my husband and in fact, my parents and parent-in-law would get together and weigh in on our decisions. I expressed my concerns about  not being able to re-enter the workforce if I continue to stay home. They (parents) vowed to take care of me and not to worry. \n\nSo, my husband turned out to be doing some shady things with our family money and the business that he ran. He was abusing our money on side girlfriends. When I found out that our life savings had eroded to almost nothing and the infidelity, I filed for divorce. There was no income  so my child support was a ridiculous amount. I found some evidence that he was hiding money in shell accounts. I told my parents that I wanted to get a lawyer and try to recoup some funds. They dissuaded me (because it would have ruined their relationship with their close friend) and again said they're take care of me.\n\nI went back to work and my degree was useless by then without relevant work experience and making minimum wage. They bought me a condo but otherwise I was scraping by for years. Then a year ago, my mom suddenly died from a blood clot. My dad almost immediately re-married to a woman decades his junior. He announced last week that he'd be changing his will to his new wife and cutting me out because he needs to make sure she will be supported. That was supposed to have been my nest egg. I was furious because I had directed my life to appease him and now he is cutting me out for a floozy who clearly does not care for him. Am I the asshole?"], "label": ["ESH", "YTA", "NTA", "NTA", "NTA", "NTA", "NTA", "INFO", "ESH", "NTA", "NTA", "NTA", "NTA", "YTA", "NTA", "YTA", "YTA", "YTA", "NTA", "INFO", "NTA", "NTA", "NTA", "ESH", "NTA", "NTA", "ESH", "NTA", "NTA", "NTA", "NTA", "NTA", "NTA", "YTA", "NTA", "YTA", "NTA", "YTA", "NTA", "YTA", "YTA", "NTA", "YTA", "YTA", "NTA", "NTA", "NTA", "NAH", "ESH", "NTA", "NTA", "NAH", "NTA", "ESH", "NTA", "ESH", "YTA", "NAH", "NAH", "YTA", "NTA", "NTA", "NTA", "NTA", "INFO", "NTA", "NTA", "NTA", "YTA", "INFO", "NTA", "NTA", "NTA", "YTA", "NTA", "NTA", "NTA", "NTA", "NTA", "NTA", "NTA", "YTA", "INFO", "YTA", "YTA", "YTA", "NTA", "NTA", "NTA", "NTA", "NAH", "NTA", "NTA", "NTA", "YTA", "NTA", "NTA", "NTA", "NTA", "NTA", "NTA", "NTA", "NAH", "YTA", "YTA", "YTA", "YTA", "NTA", "NTA", "YTA", "YTA", "NTA", "NTA", "NTA", "ESH", "NAH", "NTA", "NTA", "NAH", "NTA", "NAH", "NTA", "NTA", "YTA", "ESH", "NTA", "NTA", "NTA", "NTA", "NTA", "NTA", "NAH", "YTA", "YTA", "NTA", "NTA", "NTA", "NTA", "YTA", "NTA", "YTA", "NTA", "NTA", "NTA", "NAH", "YTA", "ESH", "YTA", "NTA"]}